Changes.org
#+TITLE: Demeter revision history
#+AUTHOR: Bruce Ravel
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="stylesheets/orgstyle.css" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="stylesheets/orgtocstyle.css" />
#+OPTIONS: toc:2

* 0.9 series
** 0.9.25   XX November  2015
*** Athena
   - Menus of groups names not updating correctly in data summation
     tool. (thanks to [[http://millenia.cars.aps.anl.gov/pipermail/ifeffit/2015-November/012833.html][Matteo Busi]])

** 0.9.24   23 October   2015
*** Demeter
   - Fix a problem related to spaces in path names when opening the
     pipe to gnuplot

*** Artemis
   - Half-hearted attempt to fix an odd edge case in importing
     old-style project files with a =FEFF.INP= file (in caps).

*** Hephaestus
   - A few changes to display of beamline customizations

** 0.9.23   15 October   2015
*** Athena
   - In plugin configuration tool, fix crashiness of "reset all"
     button (thanks to roentgenium, issue #23) Note: in the end, the
     reset_all button was commented out -- it is implemented awkwardly.
   - Changes made to plugin configuration now correctly saved to and
     restored from demeter.ini (thanks to roentgenium, issue #23)
   - implement a functional normalization control (thanks to Giuliana
     Aquilanti) {/pre3/} also athena->show_funnorm configuration
     parameter, enable control if athena project file is read which
     uses funnorm.
   - rearrange controls in normalization and background removal group
     to better distinguish which parameters control normalization and
     which background removal

*** Artemis
   - Fixed a serious problem setting windowing function in Artemis.
     There was a situation where the function could change between
     successive fits, resulting in different fitting results without
     changes to the model.  (thanks to Ian Godfrey)

*** Hephaestus
   - configurable energy width used for computing edge steps.  [[http://millenia.cars.aps.anl.gov/pipermail/ifeffit/2015-September/012762.html][see
     comment from Matthew Marcus]] {/pre3/}
   - on Data tool, added Shannon atomic radii using json version of
     [[http://v.web.umkc.edu/vanhornj/Radii.txt][David van Horn's]] compilation of the [[http://dx.doi.org/10.1107/S0567739476001551][Shannon data]] (thanks to Neil
     Hyatt)
   - On Data tool, added neutron scattering lengths and cross sections
     from [[http://dx.doi.org/10.1080/10448639208218770][V.F. Sears, Neutron News, 3:3 (1992) pp. 26-37]] and [[https://www.ncnr.nist.gov/resources/n-lengths/list.html][NIST NCNR]].
   - Better handling of enabled element buttons
   - New colors for lanthanides, actinides, and unknowns
   - Added discovery date to elemental data display
   - Added elements 110 to 118
   - Added beamline customization to Absorption page
   - Abstract element enabler for use in several places in Hephaestus
   - On Data tool: buttons for showing Mossbauer-active elements and
     elements by decade of discovery

