Changes.org
*** Demeter
   - Fixed a crashy bug in Demeter::Data::XDI
   - Removed a bit of code related to choice of plot terminal with
     Gnuplot 5 that was not respecting the configured terminal value
     (thanks to Ian Godfrey)
   - use [[https://metacpan.org/pod/File::Slurper][File::Slurper]] instead of [[https://metacpan.org/pod/File::Slurp::Tiny][File::Slurp::Tiny]] in DemeterBuilder,
     see [[http://blogs.perl.org/users/leon_timmermans/2015/08/fileslurp-is-broken-and-wrong.html][this]]
   - implement a functional normalization for use in tender energy
     fluorescence EXAFS data where I0 changes a lot over the course of
     the scan.  this divides mu(E) by (post-pre) before removing
     background (thanks to Giuliana Aquilanti) {/pre3/}
   - Plucking now works with the qt terminal, although the first
     double click of the session will always fail to return something
     useful (simply do another double-click before the time out).

*** Windows
   - Handle path munging at the level of the .bat file header. take
     care with relocation (thanks to Matt)

** 0.9.22   29 July      2015

*** Athena
   - Fixed behavior of UI::Athena::Cursor when time-out happens by
     checking if a vary large negative number is returned (thanks to
     Ian Godfrey) /{pre1}/
   - Fixed import of pre-nomralized XANES data (thanks to Ken Latham)
     {/pre4/}
   - Deglitching now plots with points (thanks to Shoaib Muhammad)
     {/pre4/}
   - Deglitching now uses energy shift correctly (thanks to Shoaib
     Muhammad) {/pre4/}
   - Do not disable "Save fit sequence" button when selecting
     groups. (Thanks to a fellow named Muhammad at the 2015 ASEAN
     Workshop on X-ray Absorption Spectroscopy)
   - A change in 0.9.20 made it impossible to change the defaults for
     plotting ranges in the four spaces.  This has been fixed.  (thanks
     to Lisa Bovenkamp) 
   - Fix buglet with ln checkbutton in col. sel. dialog reported as
     issue #22 (thanks to roetgenium)
   - Better handle case of i0_string = 1, leading to an array of ones
     for the i0 array

*** Artemis
   - Care with path-like objects when Xray::XDI is not
     available. (thanks to Ian Godfrey) /{pre1}/
   - Issue with how log file is displayed in the history window.  Had
     been regenerated from Fit object, which could cause confusion
     related to current state of Data object(s).  Now simply using log
     file which is saved in the fit folder. (thanks to Ian Godfrey and
     Jason Gaudet) /{pre2}/
   - Fix display of path labels using pathfinder->name mini-templates
     (thanks to Anna Wolska) {/pre4/}
   - Accommodate linear polarization (but not ellipticity) in Artemis
     (thanks to Anna Wolska and Shoaib Muhammad) {/pre4/} + proper
     handling of persistance in Artemis
   - Making VPaths and transfering paths now also plots in R
     automatically.  Also, options for all/marked paths. (Thanks to
     Matt) {/pre4/}
   - plot after fit now certain to respect k-weight setting in Plot
     window 
   - data+fit save file in Artemis are now XDI files 
   - crude fix for an odd situation where the _fit group's k array
     gets reset to something different from the Data k grid.
     Interpolate back onto the expected k-grid.  (thanks to Rosalie
     Hocking) 
   - Remove spurious minus sign appended to results of GDS evaluate
     button 
   - remove wxSHAPED attribute from GDS window's toolbar 

*** Hephaestus
   - [[https://github.com/bruceravel/demeter/commit/0c90d3bf4950cac9422590b6f2cc05d6153ebfa3][Added annotations]] for many Ag standards. (thanks to Ian Godfrey)
     /{pre1}/
   - Fixed molarity calculation in formula tool and set
     density/molarity units correctly (thanks for Guanghui Zhang)
     

*** Demeter
   - Manage deprecation of Module::Build from perl core by placing
     Module::Build in `inc/`.  See [[https://metacpan.org/pod/Module::Build::Cookbook#Bundling-Module::Build][this]] and [[http://www.dagolden.com/index.php/2140/paying-respect-to-modulebuild/][this]].
   - Fix several minor gnuplot display problem
   - Attempt to sensibly default to wxt terminal with gnuplot 4.6 and
     qt with gnuplot 5.0
   - Adjust build script to try to set the terminal default sensibly
     at install time
   - Fix is_json file test for files with CR line termination (thanks
     to Anna Zimina) {/pre3/}
   - Add capacity to Atoms, Feff, ScatteringPath objects to
     accommodate polarization
   - In some cases, chi_noise called with 0 for kmax.  Use fft_kmax in
     that case. 
   - Change default for copyright statement in plot to false
   - Fixed a testing bug resulting from gnuplot not being found
     (thanks to Isabelle Kieffer, see mailing list for 15 July, 2015)
   - Kernel width for rebinning is now configurable (thanks to Joel
     Ullom)

*** Windows
   - Now using gnuplot 5.0.0 in the Windows installer

** 0.9.21   26 February  2015
Begin practice of using /{preN}/ tags to indicate exactly when a
feature was added.  Also begin practice of acknowledging the
(appropriate individual) directly with the change log entry.

*** Athena
   - XDI integration (available in Demeter, but Xray::XDI is not
     currently in the Windows distribution)
   - pluck button for MEE
   - fixed a bug related to the inv button in Col Sel dialog (thanks
     to Ian Rosbottom)
   - Fixed the appearence of the Busy cursor in column & project
     selection dialogs on Windows (thanks to Ian Godrey)
   - Improvements to import of chi(k) data + LCF using chi(k) imported
     data (thanks to Andrea Foster)
   - Menu items for reporting a bug and asking a question
   - Add energy columns to chi(k) output files.  (thanks to Karina
     Mathisen) /{pre3}/
   - Take care to handle xdifile Data attribute when Xray::XDI is not
     available  (thanks to Ian Godfrey) /{pre3}/
   - Fixed faulty output file from log-ratio analysis /{pre5}/
   - Fixed a problem whereby a group using a bkg removal standard not
     present in the project would cause a crash (thanks to Allen
     Robert Morris)
   - Option for writing and reading Athena project files in a JSON
     format. (thanks to Matt for the prompt)

