Changes.html

<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">1.3.4</span> Demeter</h4>
<div class="outline-text-4" id="text-1-3-4">
<ul class="org-ul">
<li>Fixed a crashy bug in Demeter::Data::XDI</li>
<li>Removed a bit of code related to choice of plot terminal with
Gnuplot 5 that was not respecting the configured terminal value
(thanks to Ian Godfrey)</li>
<li>use <a href="https://metacpan.org/pod/File::Slurper"><a href=":Slurper">:Slurper</a></a> instead of <a href="https://metacpan.org/pod/File::Slurp::Tiny"><a href=":Slurp#MissingReference">:Slurp#MissingReference</a></a> in DemeterBuilder,
see <a href="http://blogs.perl.org/users/leon_timmermans/2015/08/fileslurp-is-broken-and-wrong.html">this</a></li>
<li>implement a functional normalization for use in tender energy
fluorescence EXAFS data where I0 changes a lot over the course of
the scan.  this divides mu(E) by (post-pre) before removing
background (thanks to Giuliana Aquilanti) {<i>pre3</i>}</li>
<li>Plucking now works with the qt terminal, although the first
double click of the session will always fail to return something
useful (simply do another double-click before the time out).</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-4">
<h4 id="orgheadline14"><span class="section-number-4">1.3.5</span> Windows</h4>
<div class="outline-text-4" id="text-1-3-5">
<ul class="org-ul">
<li>Handle path munging at the level of the .bat file header. take
care with relocation (thanks to Matt)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">1.4</span> 0.9.22   29 July      2015</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16"><span class="section-number-4">1.4.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>Fixed behavior of UI::Athena::Cursor when time-out happens by
checking if a vary large negative number is returned (thanks to
Ian Godfrey) <i>{pre1}</i></li>
<li>Fixed import of pre-nomralized XANES data (thanks to Ken Latham)
{<i>pre4</i>}</li>
<li>Deglitching now plots with points (thanks to Shoaib Muhammad)
{<i>pre4</i>}</li>
<li>Deglitching now uses energy shift correctly (thanks to Shoaib
Muhammad) {<i>pre4</i>}</li>
<li>Do not disable "Save fit sequence" button when selecting
groups. (Thanks to a fellow named Muhammad at the 2015 ASEAN
Workshop on X-ray Absorption Spectroscopy)</li>
<li>A change in 0.9.20 made it impossible to change the defaults for
plotting ranges in the four spaces.  This has been fixed.  (thanks
to Lisa Bovenkamp)</li>
<li>Fix buglet with ln checkbutton in col. sel. dialog reported as
issue #22 (thanks to roetgenium)</li>
<li>Better handle case of i0<sub>string</sub> = 1, leading to an array of ones
for the i0 array</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="section-number-4">1.4.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li>Care with path-like objects when Xray::XDI is not
available. (thanks to Ian Godfrey) <i>{pre1}</i></li>
<li>Issue with how log file is displayed in the history window.  Had
been regenerated from Fit object, which could cause confusion
related to current state of Data object(s).  Now simply using log
file which is saved in the fit folder. (thanks to Ian Godfrey and
Jason Gaudet) <i>{pre2}</i></li>
<li>Fix display of path labels using pathfinder-&gt;name mini-templates
(thanks to Anna Wolska) {<i>pre4</i>}</li>
<li>Accommodate linear polarization (but not ellipticity) in Artemis
(thanks to Anna Wolska and Shoaib Muhammad) {<i>pre4</i>} + proper
handling of persistance in Artemis</li>
<li>Making VPaths and transfering paths now also plots in R
automatically.  Also, options for all/marked paths. (Thanks to
Matt) {<i>pre4</i>}</li>
<li>plot after fit now certain to respect k-weight setting in Plot
window</li>
<li>data+fit save file in Artemis are now XDI files</li>
<li>crude fix for an odd situation where the _fit group's k array
gets reset to something different from the Data k grid.
Interpolate back onto the expected k-grid.  (thanks to Rosalie
Hocking)</li>
<li>Remove spurious minus sign appended to results of GDS evaluate
button</li>
<li>remove wxSHAPED attribute from GDS window's toolbar</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18"><span class="section-number-4">1.4.3</span> Hephaestus</h4>
<div class="outline-text-4" id="text-1-4-3">
<ul class="org-ul">
<li><a href="https://github.com/bruceravel/demeter/commit/0c90d3bf4950cac9422590b6f2cc05d6153ebfa3">Added annotations</a> for many Ag standards. (thanks to Ian Godfrey)
<i>{pre1}</i></li>
<li>Fixed molarity calculation in formula tool and set
density/molarity units correctly (thanks for Guanghui Zhang)</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">1.4.4</span> Demeter</h4>
<div class="outline-text-4" id="text-1-4-4">
<ul class="org-ul">
<li>Manage deprecation of Module::Build from perl core by placing
Module::Build in `inc/`.  See <a href="https://metacpan.org/pod/Module::Build::Cookbook#Bundling-Module::Build">this</a> and <a href="http://www.dagolden.com/index.php/2140/paying-respect-to-modulebuild/">this</a>.</li>
<li>Fix several minor gnuplot display problem</li>
<li>Attempt to sensibly default to wxt terminal with gnuplot 4.6 and
qt with gnuplot 5.0</li>
<li>Adjust build script to try to set the terminal default sensibly
at install time</li>
<li>Fix is<sub>json</sub> file test for files with CR line termination (thanks
to Anna Zimina) {<i>pre3</i>}</li>
<li>Add capacity to Atoms, Feff, ScatteringPath objects to
accommodate polarization</li>
<li>In some cases, chi<sub>noise</sub> called with 0 for kmax.  Use fft<sub>kmax</sub> in
that case.</li>
<li>Change default for copyright statement in plot to false</li>
<li>Fixed a testing bug resulting from gnuplot not being found
(thanks to Isabelle Kieffer, see mailing list for 15 July, 2015)</li>
<li>Kernel width for rebinning is now configurable (thanks to Joel
Ullom)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">1.4.5</span> Windows</h4>
<div class="outline-text-4" id="text-1-4-5">
<ul class="org-ul">
<li>Now using gnuplot 5.0.0 in the Windows installer</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">1.5</span> 0.9.21   26 February  2015</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Begin practice of using <i>{preN}</i> tags to indicate exactly when a
feature was added.  Also begin practice of acknowledging the
(appropriate individual) directly with the change log entry.
</p>
</div>

<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">1.5.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li>XDI integration (available in Demeter, but Xray::XDI is not
currently in the Windows distribution)</li>
<li>pluck button for MEE</li>
<li>fixed a bug related to the inv button in Col Sel dialog (thanks
to Ian Rosbottom)</li>
<li>Fixed the appearence of the Busy cursor in column &amp; project
selection dialogs on Windows (thanks to Ian Godrey)</li>
<li>Improvements to import of chi(k) data + LCF using chi(k) imported
data (thanks to Andrea Foster)</li>
<li>Menu items for reporting a bug and asking a question</li>
<li>Add energy columns to chi(k) output files.  (thanks to Karina
Mathisen) <i>{pre3}</i></li>
<li>Take care to handle xdifile Data attribute when Xray::XDI is not
available  (thanks to Ian Godfrey) <i>{pre3}</i></li>
<li>Fixed faulty output file from log-ratio analysis <i>{pre5}</i></li>
<li>Fixed a problem whereby a group using a bkg removal standard not
present in the project would cause a crash (thanks to Allen
Robert Morris)</li>
<li>Option for writing and reading Athena project files in a JSON
format. (thanks to Matt for the prompt)</li>
</ul>
</div>
</div>
