Changes.org
*** Artemis
   - Disable run atoms and run feff buttons after first DnD of a path
     (thanks to Yanyun Hu)
   - XDI related bug in Demeter::Fit (thanks to Allen Robert Morris)
   - Add a line about background removal parameters to Artemis log
     (thanks to Sebastiano Cammelli)
   - Menu items for reporting a bug and asking a question
   - Fix problems importing a project file containing FSPaths -- need
     to recompute Feff at the correct time.  (thanks to Ian Godfrey) /{pre2}/
   - Correctly display initial guesses of 0 when reading GDS values
     from a project file.  (thanks to Ian Godfrey) /{pre3}/

*** Atoms
   - Menu items for reporting a bug and asking a question
   - slapped an eval around the feff run.  this allows feff to fail a
     bit more gracefully.  feff's error message gets sent to STDERR
     (i.e. the screen or the log file on Windows) and an inscrutible
     message gets posted via carp, but Artemis/Atoms does not crash.
     (thanks to Stephen Parry) /{pre4}/

*** Hephaestus
   - Menu items for reporting a bug and asking a question

*** Demeter
   - Sensible message and die when encountering a problem loading
     Ifeffit.pm or Larch.pm (thanks to Eric Breynaert)
   - Expunge all reference to my email address, replacing it with a
     link to my homepage
   - Work around the mysterious situation on Windows wherein the MRU
     file gets overwritten with a few hundred NUL characters, causing
     a crash in Config::INI::Reader.  I have no idea what causes this,
     but changing from croak to carp when handling an unparsed line
     avoids it and issues a useful error message.  (thanks to Kurinji
     Krishnamoorthy)
   - XKCD-ish plots in A&A
   - font picker control now available in Demeter::Wx::Config
   - Update tests to reflect recent larch-related changes (thanks to
     Stevan Ognjanovic)
   - Fix a silly mistake introduced to one of the Chantler data files
     when I did s{2014}{2015}g in January (thanks to Stevan
     Ognjanovic)

*** Larch
   - Much work on both Athena and Artemis to work properly with Larch,
     particularly in light of recent changes to larch server
   - Made "l" versions of A, A, and H.  These set DEMETER_BACKEND to
     "larch" in the BEGIN block
   - Made ~larch_server.ini~ file, specify windows path for
     larch_server

*** Windows
   - Add Demeter version number to screen/log file messages /{pre3}/

** 0.9.20   12 May       2014

*** Athena
   - File drag-n-drop onto the group list from the system file manager
   - Control-left-click for reorganzing group list items disabled in
     favor of file drag-n-drop
   - Booth self-absorption algorithm now implemented correctly
   - Added Hephaestus doc to the Athena Users' Guide
   - remove coloration characters when saving the contents of the
     status bar buffer so as not to trigger perl's wide character
     warning
   - error messages for zero plotting range, excessive columns in save
     marked groups with Ifeffit, and lots of groups with Ifeffit
   - added refresh project menu option as a fallback for occassional
     problem of data not updating
   - fixed a bug processing normalized groups
   - added biquad plot, in Plot menu + right click on purple q button
   - wxWidgets 3.0 changes the semantics for the GetSelection method
     for controls that can possibly have multiple selection, including
     the widget used to select a processing standard.  In those cases
     GetSelection is now explicitly called with scalar so that single
     selection is processed correctly
   - deglitch and truncate parameters are now persistent within an
     instance -- this facilitates efficient processing of many data
     sets with a similar problem, such a diffraction peak

*** Artemis
   - Drag and drop Athena or Artemis project files onto the Data list
   - Drag and drop CIF, Atoms, Feff input files onto the Feff list
   - Removed dependence on Wx::Html (causes seg fault on Mac, not
     really very important) and removed print and print preview
     buttons from History, Log, and Journal
   - fixed problems handling import of chi(k) data into Artemis
     + fixed a problem serializing data that had been imported as chi(k)
     + take care to toggle the from_yaml attribute to true when
       importing data from a project file.  this was needed to pass
       the "data exists" fit sanity check
   - corrected an odd bug whereby relation between a FSPath and it's
     Feff calculation could be lost in a project file (see thread
     starting at
     http://www.mail-archive.com/ifeffit@millenia.cars.aps.anl.gov/msg04288.html)
   - save path interpretation from Path page in Atoms window
   - reorganized some buttons in the Atoms window
   - attempted to fix a bug wherein an incorrect argument could be
     sent to Wx::ComboBox's SetStringSelection method in Align, LCF,
     and a few other places
   - parse a feff.inp file for feff8/9 correctly for use with feff6
   - I think I've fixed the problem of the data set being lost if a
     project is saved before a fit is made
   - fixed a display problem with radio button label widths on SS tab
     in Atoms

*** Hephaestus
   - Document now displayed in the system web browser (Wx::Html was
     not working on the Mac)
   - Removed dependence on Wx::Html by not loading
     Demeter::UI::Hephaestus::Help
   - added some more standards and using new standards subsystem
     enhancements
   - fixed a bug computing unit edge steps in materials with close
     edges
   - made the main window a bit bigger so that all controls are
     properly displayed

