Changes.html

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">1.5.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li>Disable run atoms and run feff buttons after first DnD of a path
(thanks to Yanyun Hu)</li>
<li>XDI related bug in Demeter::Fit (thanks to Allen Robert Morris)</li>
<li>Add a line about background removal parameters to Artemis log
(thanks to Sebastiano Cammelli)</li>
<li>Menu items for reporting a bug and asking a question</li>
<li>Fix problems importing a project file containing FSPaths &#x2013; need
to recompute Feff at the correct time.  (thanks to Ian Godfrey) <i>{pre2}</i></li>
<li>Correctly display initial guesses of 0 when reading GDS values
from a project file.  (thanks to Ian Godfrey) <i>{pre3}</i></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">1.5.3</span> Atoms</h4>
<div class="outline-text-4" id="text-1-5-3">
<ul class="org-ul">
<li>Menu items for reporting a bug and asking a question</li>
<li>slapped an eval around the feff run.  this allows feff to fail a
bit more gracefully.  feff's error message gets sent to STDERR
(i.e. the screen or the log file on Windows) and an inscrutible
message gets posted via carp, but Artemis/Atoms does not crash.
(thanks to Stephen Parry) <i>{pre4}</i></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">1.5.4</span> Hephaestus</h4>
<div class="outline-text-4" id="text-1-5-4">
<ul class="org-ul">
<li>Menu items for reporting a bug and asking a question</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">1.5.5</span> Demeter</h4>
<div class="outline-text-4" id="text-1-5-5">
<ul class="org-ul">
<li>Sensible message and die when encountering a problem loading
Ifeffit.pm or Larch.pm (thanks to Eric Breynaert)</li>
<li>Expunge all reference to my email address, replacing it with a
link to my homepage</li>
<li>Work around the mysterious situation on Windows wherein the MRU
file gets overwritten with a few hundred NUL characters, causing
a crash in Config::INI::Reader.  I have no idea what causes this,
but changing from croak to carp when handling an unparsed line
avoids it and issues a useful error message.  (thanks to Kurinji
Krishnamoorthy)</li>
<li>XKCD-ish plots in A&amp;A</li>
<li>font picker control now available in Demeter::Wx::Config</li>
<li>Update tests to reflect recent larch-related changes (thanks to
Stevan Ognjanovic)</li>
<li>Fix a silly mistake introduced to one of the Chantler data files
when I did s{2014}{2015}g in January (thanks to Stevan
Ognjanovic)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">1.5.6</span> Larch</h4>
<div class="outline-text-4" id="text-1-5-6">
<ul class="org-ul">
<li>Much work on both Athena and Artemis to work properly with Larch,
particularly in light of recent changes to larch server</li>
<li>Made "l" versions of A, A, and H.  These set DEMETER<sub>BACKEND</sub> to
"larch" in the BEGIN block</li>
<li>Made <code>larch_server.ini</code> file, specify windows path for
larch<sub>server</sub></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">1.5.7</span> Windows</h4>
<div class="outline-text-4" id="text-1-5-7">
<ul class="org-ul">
<li>Add Demeter version number to screen/log file messages <i>{pre3}</i></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline38" class="outline-3">
<h3 id="orgheadline38"><span class="section-number-3">1.6</span> 0.9.20   12 May       2014</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">1.6.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-6-1">
<ul class="org-ul">
<li>File drag-n-drop onto the group list from the system file manager</li>
<li>Control-left-click for reorganzing group list items disabled in
favor of file drag-n-drop</li>
<li>Booth self-absorption algorithm now implemented correctly</li>
<li>Added Hephaestus doc to the Athena Users' Guide</li>
<li>remove coloration characters when saving the contents of the
status bar buffer so as not to trigger perl's wide character
warning</li>
<li>error messages for zero plotting range, excessive columns in save
marked groups with Ifeffit, and lots of groups with Ifeffit</li>
<li>added refresh project menu option as a fallback for occassional
problem of data not updating</li>
<li>fixed a bug processing normalized groups</li>
<li>added biquad plot, in Plot menu + right click on purple q button</li>
<li>wxWidgets 3.0 changes the semantics for the GetSelection method
for controls that can possibly have multiple selection, including
the widget used to select a processing standard.  In those cases
GetSelection is now explicitly called with scalar so that single
selection is processed correctly</li>
<li>deglitch and truncate parameters are now persistent within an
instance &#x2013; this facilitates efficient processing of many data
sets with a similar problem, such a diffraction peak</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-4">
<h4 id="orgheadline31"><span class="section-number-4">1.6.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-6-2">
<ul class="org-ul">
<li>Drag and drop Athena or Artemis project files onto the Data list</li>
<li>Drag and drop CIF, Atoms, Feff input files onto the Feff list</li>
<li>Removed dependence on Wx::Html (causes seg fault on Mac, not
really very important) and removed print and print preview
buttons from History, Log, and Journal</li>
<li>fixed problems handling import of chi(k) data into Artemis
<ul class="org-ul">
<li>fixed a problem serializing data that had been imported as chi(k)</li>
<li>take care to toggle the from<sub>yaml</sub> attribute to true when
importing data from a project file.  this was needed to pass
the "data exists" fit sanity check</li>
</ul></li>
<li>corrected an odd bug whereby relation between a FSPath and it's
Feff calculation could be lost in a project file (see thread
starting at
<a href="http://www.mail-archive.com/ifeffit@millenia.cars.aps.anl.gov/msg04288.html">http://www.mail-archive.com/ifeffit@millenia.cars.aps.anl.gov/msg04288.html</a>)</li>
<li>save path interpretation from Path page in Atoms window</li>
<li>reorganized some buttons in the Atoms window</li>
<li>attempted to fix a bug wherein an incorrect argument could be
sent to Wx::ComboBox's SetStringSelection method in Align, LCF,
and a few other places</li>
<li>parse a feff.inp file for feff8/9 correctly for use with feff6</li>
<li>I think I've fixed the problem of the data set being lost if a
project is saved before a fit is made</li>
<li>fixed a display problem with radio button label widths on SS tab
in Atoms</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline32" class="outline-4">
<h4 id="orgheadline32"><span class="section-number-4">1.6.3</span> Hephaestus</h4>
<div class="outline-text-4" id="text-1-6-3">
<ul class="org-ul">
<li>Document now displayed in the system web browser (Wx::Html was
not working on the Mac)</li>
<li>Removed dependence on Wx::Html by not loading
Demeter::UI::Hephaestus::Help</li>
<li>added some more standards and using new standards subsystem
enhancements</li>
<li>fixed a bug computing unit edge steps in materials with close
edges</li>
<li>made the main window a bit bigger so that all controls are
properly displayed</li>
</ul>
</div>
</div>
