Changes.org
*** Atoms
   - sensible error messages from CLI version when no input file
     specified or when file does not exist
   - added atoms-gui script to bin folder
   - fixed a bug related to importing a feff.inp file directly onto
     the feff page in the Atoms GUI
   - import buttons on Atoms and Feff pages respond sensibly to files
     that are not CIF/atoms or feff files
   - enable aggregate calculation (given that paper will be accepted
     for publication by the time this is released), but only for Atoms
     in Artemis, not for stand-alone.  Wrote documentation page for
     aggregate calculation
   - put controls for degeneracy margins front and center
   - deal sensibly with Feff's hard-wired maximum cluster size of 500
     atoms by writing only the first 499 sites, regardless of how many
     atoms are within Rmax
   - somehow, the shift vector never got implemented in Demeter (even
     though there are controls for it in the Atoms GUI).  Wow!  That
     is now fixed.
   - fixed a mistake reading space group symbols from CIF files when
     an alternate orthorhombic setting was used in the CIF file
   - progress on getting Atoms and the GUI to work correctly with
     rhombohedral groups
   - new button in GUI for inserting shift vector from Int'l tables
   - launching GUI from command line now respects input file argument
   - handle =:R=, =:H=, =:1=, and =:2= symbol modifiers

*** Larch
   - Athena w/Larch now mostly works on Windows
   - use fill_value=0.0 with interp() to avoid issues with NaN values
     in arrays (no longer necessary, see https://github.com/xraypy/xraylarch/issues/63)
   - escape backslashes in filenames before sending them to Larch

*** Demeter
   - lots of code clean-up
   - improved methodology for populating Config pages in the GUIs
   - improvements to the PDF versions of the users' guides
   - return to using wxFD_OVERWRITE_PROMPT with Wx::FileDialog rather
     than Demeter::UI::Wx::OverwritePrompt, which was fixing a problem
     in GTK 2.20
   - several enhancements to standards subsystem

*** Windows / Mac
   - This is the drop-the-D edition for Windows.  The desktop icons
     no longer have "(D)" in their names.
   - Athena w/Larch now mostly works on Windows
   - Fixed a problem with real and integer configuration parameters
     being unset upon first time running Demeter. *This was the
     problem requiring the withdrawal of 0.9.19*
   - Attempt to deal with background color problem on Mac with
     Demeter::UI::Wx:Colours
   - Added Encoding::FixLatin::XS to the package to suppress a
     spurious message triggered when drag-n-dropping files in Athena
     and made it recommended in Build.PL
   - now building 32 and 64 bit packages for Windows
   - using head of ifeffit repo at github

*** Acknowledgements
   - Georges Siddiqi, Kevin Jorissen, Robert Gordon, Shoaib Muhammad
     all helped me address the problems with the 0.9.19 release on
     Windows
   - Frank Schima made yeoman's progress on a MacPorts version of
     Demeter.  He also suggested file drag-n-drop.
   - George Strbinsky helped me track down some issues in the
     Macports version
   - Ian Godfrey filed a bug report that uncovered two problems with
     importing chi(k) data directly into Artemis
   - Zack Gainsforth for additions/enhancements to standards system
   - Mengling Stuckman for reporting on an odd FSPath bug
   - Matt Frith for reporting a bug importing a feff.inp directly into
     the Feff page of the Atoms GUI
   - Dean Hesterburg pointed out a bug processing normalized groups.
   - Daniel Haskel noticed the Hephaestus bug for unit edges steps in
     materials with close-by edges
   - Madhusmita Sahoo noticed that the shift vector was unimplemented
   - Badari Rao reported the problem with data being lost when saving
     an Artemis project before doing a fit

** 0.9.19    8 January   2014 (withdrawn)

The windows installer for this release had too many problems and was
withdrawn a couple of days after its release.  One of the goals of
0.9.20 is to correct those problems.

*** Athena
   - escape group names when renaming, i.e. treat metacharacters in
     group names as normal characters
   - fixed a bug which disabled the Plot->Merge groups menu
   - Added datatype display on main window, Ctrl-Alt-Left click to
     toggle between xmu and xanes, abuse a HyperlinkCtrl to get a
     mouseover hint
   - improved X23A2MED plugin to deal with situation where tranmission
     is measured with the cap on the detector, resulting in some 0s in
     the slow column
   - choice of X-ray absorption tables now easily configurable in
     "absorption" group
   - fixed a bunch of problems with the Booth self-absorption
     algorithm
   - keyboard shortcuts for merging (C-S-m, C-S-n, C-S-c for merging
     in mu, norm, chi)
   - right click on several plot buttons makes a special plot from the
     Plot menu + status bar hints
   - added "Shrink" to plot options.  this hides the k-weight and plot
     options controls, allowing more room for the group list.  also
     shows a button for restoring the k-weight and plot options
     controls
   - added "Show measurement uncertainties" submenu to Group menu with
     options for this, marked, and all

*** Artemis
   - Fixed a bug in SSPath creation by drag-n-drop from pathlike tab
   - Add a site button now working on Atoms page
   - Graceful failure and useful warning message if crystal data
     results in 0 scatterers
   - Fixed a crashy bug running feff resulting a missed step after
     discarding a Feff calculation
   - Merged fix for unicode filenames in Artemis project file (see
     https://github.com/bruceravel/demeter/pull/13)
   - Deal better with a project file saved before performing a fit
   - A bit more control over labels in path list with
     artemis->feffpathlist config parameter
   - Athena file MRU list now remembers record number and defaults to
     that record when selected
   - fixed a bug resulting in repetitious display of parameter values
     in log file
   - save VPaths to and restore from Artemis project files
   - added "transfer all" button to VPaths tab in Plot window

*** Atoms
   - fixed a bug processing hexagonal and trigonal groups with the
     command line atoms.  oddly, these were handled correctly by the
     Wx version
   - Implemented Aggregate Feff calculation on Atoms Xtal tab
   - use path ranking choice to make intrp and display all rankings
     from button on intrp page

