Changes.html

<div id="outline-container-orgheadline33" class="outline-4">
<h4 id="orgheadline33"><span class="section-number-4">1.6.4</span> Atoms</h4>
<div class="outline-text-4" id="text-1-6-4">
<ul class="org-ul">
<li>sensible error messages from CLI version when no input file
specified or when file does not exist</li>
<li>added atoms-gui script to bin folder</li>
<li>fixed a bug related to importing a feff.inp file directly onto
the feff page in the Atoms GUI</li>
<li>import buttons on Atoms and Feff pages respond sensibly to files
that are not CIF/atoms or feff files</li>
<li>enable aggregate calculation (given that paper will be accepted
for publication by the time this is released), but only for Atoms
in Artemis, not for stand-alone.  Wrote documentation page for
aggregate calculation</li>
<li>put controls for degeneracy margins front and center</li>
<li>deal sensibly with Feff's hard-wired maximum cluster size of 500
atoms by writing only the first 499 sites, regardless of how many
atoms are within Rmax</li>
<li>somehow, the shift vector never got implemented in Demeter (even
though there are controls for it in the Atoms GUI).  Wow!  That
is now fixed.</li>
<li>fixed a mistake reading space group symbols from CIF files when
an alternate orthorhombic setting was used in the CIF file</li>
<li>progress on getting Atoms and the GUI to work correctly with
rhombohedral groups</li>
<li>new button in GUI for inserting shift vector from Int'l tables</li>
<li>launching GUI from command line now respects input file argument</li>
<li>handle <code>:R</code>, <code>:H</code>, <code>:1</code>, and <code>:2</code> symbol modifiers</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline34" class="outline-4">
<h4 id="orgheadline34"><span class="section-number-4">1.6.5</span> Larch</h4>
<div class="outline-text-4" id="text-1-6-5">
<ul class="org-ul">
<li>Athena w/Larch now mostly works on Windows</li>
<li>use fill<sub>value</sub>=0.0 with interp() to avoid issues with NaN values
in arrays (no longer necessary, see <a href="https://github.com/xraypy/xraylarch/issues/63">https://github.com/xraypy/xraylarch/issues/63</a>)</li>
<li>escape backslashes in filenames before sending them to Larch</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline35" class="outline-4">
<h4 id="orgheadline35"><span class="section-number-4">1.6.6</span> Demeter</h4>
<div class="outline-text-4" id="text-1-6-6">
<ul class="org-ul">
<li>lots of code clean-up</li>
<li>improved methodology for populating Config pages in the GUIs</li>
<li>improvements to the PDF versions of the users' guides</li>
<li>return to using wxFD<sub>OVERWRITE</sub><sub>PROMPT</sub> with Wx::FileDialog rather
than Demeter::UI::Wx::OverwritePrompt, which was fixing a problem
in GTK 2.20</li>
<li>several enhancements to standards subsystem</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">1.6.7</span> Windows / Mac</h4>
<div class="outline-text-4" id="text-1-6-7">
<ul class="org-ul">
<li>This is the drop-the-D edition for Windows.  The desktop icons
no longer have "(D)" in their names.</li>
<li>Athena w/Larch now mostly works on Windows</li>
<li>Fixed a problem with real and integer configuration parameters
being unset upon first time running Demeter. <b>This was the
problem requiring the withdrawal of 0.9.19</b></li>
<li>Attempt to deal with background color problem on Mac with
Demeter::UI::Wx:Colours</li>
<li>Added Encoding::FixLatin::XS to the package to suppress a
spurious message triggered when drag-n-dropping files in Athena
and made it recommended in Build.PL</li>
<li>now building 32 and 64 bit packages for Windows</li>
<li>using head of ifeffit repo at github</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline37" class="outline-4">
<h4 id="orgheadline37"><span class="section-number-4">1.6.8</span> Acknowledgements</h4>
<div class="outline-text-4" id="text-1-6-8">
<ul class="org-ul">
<li>Georges Siddiqi, Kevin Jorissen, Robert Gordon, Shoaib Muhammad
all helped me address the problems with the 0.9.19 release on
Windows</li>
<li>Frank Schima made yeoman's progress on a MacPorts version of
Demeter.  He also suggested file drag-n-drop.</li>
<li>George Strbinsky helped me track down some issues in the
Macports version</li>
<li>Ian Godfrey filed a bug report that uncovered two problems with
importing chi(k) data directly into Artemis</li>
<li>Zack Gainsforth for additions/enhancements to standards system</li>
<li>Mengling Stuckman for reporting on an odd FSPath bug</li>
<li>Matt Frith for reporting a bug importing a feff.inp directly into
the Feff page of the Atoms GUI</li>
<li>Dean Hesterburg pointed out a bug processing normalized groups.</li>
<li>Daniel Haskel noticed the Hephaestus bug for unit edges steps in
materials with close-by edges</li>
<li>Madhusmita Sahoo noticed that the shift vector was unimplemented</li>
<li>Badari Rao reported the problem with data being lost when saving
an Artemis project before doing a fit</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline45" class="outline-3">
<h3 id="orgheadline45"><span class="section-number-3">1.7</span> 0.9.19    8 January   2014 (withdrawn)</h3>
<div class="outline-text-3" id="text-1-7">
<p>
The windows installer for this release had too many problems and was
withdrawn a couple of days after its release.  One of the goals of
0.9.20 is to correct those problems.
</p>
</div>

<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">1.7.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-7-1">
<ul class="org-ul">
<li>escape group names when renaming, i.e. treat metacharacters in
group names as normal characters</li>
<li>fixed a bug which disabled the Plot-&gt;Merge groups menu</li>
<li>Added datatype display on main window, Ctrl-Alt-Left click to
toggle between xmu and xanes, abuse a HyperlinkCtrl to get a
mouseover hint</li>
<li>improved X23A2MED plugin to deal with situation where tranmission
is measured with the cap on the detector, resulting in some 0s in
the slow column</li>
<li>choice of X-ray absorption tables now easily configurable in
"absorption" group</li>
<li>fixed a bunch of problems with the Booth self-absorption
algorithm</li>
<li>keyboard shortcuts for merging (C-S-m, C-S-n, C-S-c for merging
in mu, norm, chi)</li>
<li>right click on several plot buttons makes a special plot from the
Plot menu + status bar hints</li>
<li>added "Shrink" to plot options.  this hides the k-weight and plot
options controls, allowing more room for the group list.  also
shows a button for restoring the k-weight and plot options
controls</li>
<li>added "Show measurement uncertainties" submenu to Group menu with
options for this, marked, and all</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline40" class="outline-4">
<h4 id="orgheadline40"><span class="section-number-4">1.7.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-7-2">
<ul class="org-ul">
<li>Fixed a bug in SSPath creation by drag-n-drop from pathlike tab</li>
<li>Add a site button now working on Atoms page</li>
<li>Graceful failure and useful warning message if crystal data
results in 0 scatterers</li>
<li>Fixed a crashy bug running feff resulting a missed step after
discarding a Feff calculation</li>
<li>Merged fix for unicode filenames in Artemis project file (see
<a href="https://github.com/bruceravel/demeter/pull/13">https://github.com/bruceravel/demeter/pull/13</a>)</li>
<li>Deal better with a project file saved before performing a fit</li>
<li>A bit more control over labels in path list with
artemis-&gt;feffpathlist config parameter</li>
<li>Athena file MRU list now remembers record number and defaults to
that record when selected</li>
<li>fixed a bug resulting in repetitious display of parameter values
in log file</li>
<li>save VPaths to and restore from Artemis project files</li>
<li>added "transfer all" button to VPaths tab in Plot window</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline41" class="outline-4">
<h4 id="orgheadline41"><span class="section-number-4">1.7.3</span> Atoms</h4>
<div class="outline-text-4" id="text-1-7-3">
<ul class="org-ul">
<li>fixed a bug processing hexagonal and trigonal groups with the
command line atoms.  oddly, these were handled correctly by the
Wx version</li>
<li>Implemented Aggregate Feff calculation on Atoms Xtal tab</li>
<li>use path ranking choice to make intrp and display all rankings
from button on intrp page</li>
</ul>
</div>
</div>
