Changes.org
*** Demeter
   - Made the Demeter::Feff::Aggregate object for performing the
     pathfinder fuzzily over multiple crystallographic sites.
   - Addressed some failed tests in 012_atoms
   - Fixed a problem with fixed edge step value and XANES data
   - Added plus/minus sign to Demeter::UI::Wx::SpecialCharacters
   - Require MooseX::Types::LaxNum since Moose now has a much more
     strict definition of Num in a type constraint.
   - Fixed an issue surrounding Plot object's terminal_number
     parameter and pgplot
   - Fixed a bug in the filetype plugin for the Lytle database
   - Require Archive::Zip >= 1.31 to get the option of
     Archive::Zip::UNICODE=1 which should help computers with unicode
     language settings
   - Implement Karine Provost's path ranking criteria

*** Windows
   - New installer package with perl 5.18.1 and most recent versions
     of all dependencies
   - New installer removes old installation before installing

*** Acknowledgments
   - _Fred Mosselmans_ noticed that the add a site button didn't work
     in Atoms and that a project file saved before a fit is performed
     will crash Artemis
   - _Andrei Shiryaev_ and _Fen Fen Zhu_ noticed that unicode in
     Artemis project files was problematic and _Matt Newville_
     suggested a solution
   - _Denis Testamale_ noticed that test 012_atoms was failing
   - _George Sterbinsky_ for noting that a fixed edge step value was
     not respected for XANES data, for noticing the problem renaming
     Athena group names, and for noticing numeric type constraint
     issue with Moose>=2.0900.
   - _Eric Breynaert_ for noticing a crash after discarding a Feff
     calculation
   - _Julius Campecino_ for noticing an inelegant handling of a
     situation where running atoms results in 0 scatterers
   - _Karin Provost_ for the idea of path ranking
   - _Daniel Olive_ and _Corwin Booth_ for pointing out that the Booth
     self-absorption implementation was horribly flawed

** 0.9.18.3 28 January   2014

This is a branch created to facilitate development of the Macports
package.  It has the following changes:

  1. Remove the dependence on Wx::Html and Wx::HtmlEasyPrinting, which
     is my suspect for the source of the seg fault

  2. Backport a requirement of MooseX::Types::LaxNum from 0.9.19.
     This solves a problem resulting from a recent change to the Moose
     object system, which Demeter relies upon.

  3. Backport from HEAD the use of Wx::LaunchDefaultBrowser in
     Hephaestus.  This removes the need for Wx::Html and uses the
     system browser to display the documentation, which works in
     Athena.

  4. Adds the CPAN modules MooseX::Types::LaxNum to the requirements
     in Build.PL

  5. Backports from HEAD a page in the Athena Users' Guide and
     several image file so that Hephaestus has something to show in the
     browser

  6. Backport from HEAD the changes to the datoms script

** 0.9.18.2 29 August    2013

*** Artemis
   + Fixed several bugs importing old-style artemis projects

*** Acknowledgments
   + _Mattie Peck_ for reporting these problems importing old-style Artemis projects

** 0.9.18.1 28 August    2013
*** Athena
   + Fixed a bug involving the order of items in Athena's main menu

** 0.9.18   27 August    2013
*** Athena
   + Display uncertainties in fitted E0 shifts
   + fixed an issue making plots via orange and purple buttons with certain tools displayed
   + Improvements to LCF tool
     - LCF tool: the interaction of individual and over-all e0 shifts now makes sense
     - linear term in LCF fit disabled when using ifeffit
     - reorganized widgets on LCF tool, added mouseover hints
   + improvements to the peak fitting tool
     - scrolled area now working correctly
     - now capable of 4-parameter lineshapes
     - initial guess for step width is core hole lifetime
     - fit sequence on marked groups
     - plot of individual parameter values over a sequence
     - pseudo-Voigt now available from Ifeffit
     - sanity check of parameter values before fitting
     - pluck buttons for fit range work
   + Applications of white line position finder
     - set e0 to white line top
     - find + plot (this group) or tabulate (all and marked) white line positions
     - configuration parameter group for controlling algorithm
   + Multi-electron excitation removal tool
   + Move several items from Group menu to a new Energy menu
   + fixed a bug that had the red save indicator changing color too quickly
   + use new list-returning filetype plugin by calling Import recursively after generating the list
   + up and down, (alt/ctrl)-(j/k) now mapped correctly (j=down, k=up)
   + fixed a problem importing chi(k) data from an ascii file
   + in column selection dialog when selecting energy column, Athena rechecks energy units of new selection
   + plot norm(E) scaled by size of edge step (from Plot menu)
   + Fixed a PCA bug involving mistakes keeping track of which groups are included in the PCA stack

*** Artemis
   + Benefit by improved pathfinder performance
   + Clear project name when closing a project
   + fixed a problem importing data via "Open project or data" in certain situations
   + temporarily disable any non-critical sanity check for a fit
   + button for not saving a fit to the history
   + recognize keep attribute of fit object for finer control over history creation
   + display contents of misc.dat in Path page header
   + pathinder->postcrit parameter to restrict pathlist on intrp page
   + use new path selection tool on Path page
   + remove autosave files if user chooses not to import them
   + data from Athena project file which uses a background removal
     standard is now imported correctly along with the data for the
     removal standard
   + add tool for computing bond valence sums from marked path(s)
   + new pre-fit sanity check to make sure that GDS parameter names only have allowed characters
   + right click on cards in feff.inp to go directly to the on-line Feff documentation
   + button to evaluate and display GDS parameter without fitting (i.e. "spell-check" your def parameters)
   + can now stretch the Data window and adjust the size of the path list

