Changes.html

<div id="outline-container-orgheadline42" class="outline-4">
<h4 id="orgheadline42"><span class="section-number-4">1.7.4</span> Demeter</h4>
<div class="outline-text-4" id="text-1-7-4">
<ul class="org-ul">
<li>Made the Demeter::Feff::Aggregate object for performing the
pathfinder fuzzily over multiple crystallographic sites.</li>
<li>Addressed some failed tests in 012<sub>atoms</sub></li>
<li>Fixed a problem with fixed edge step value and XANES data</li>
<li>Added plus/minus sign to Demeter::UI::Wx::SpecialCharacters</li>
<li>Require MooseX::Types::LaxNum since Moose now has a much more
strict definition of Num in a type constraint.</li>
<li>Fixed an issue surrounding Plot object's terminal<sub>number</sub>
     parameter and pgplot</li>
<li>Fixed a bug in the filetype plugin for the Lytle database</li>
<li>Require Archive::Zip &gt;= 1.31 to get the option of
Archive::Zip::UNICODE=1 which should help computers with unicode
language settings</li>
<li>Implement Karine Provost's path ranking criteria</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline43" class="outline-4">
<h4 id="orgheadline43"><span class="section-number-4">1.7.5</span> Windows</h4>
<div class="outline-text-4" id="text-1-7-5">
<ul class="org-ul">
<li>New installer package with perl 5.18.1 and most recent versions
of all dependencies</li>
<li>New installer removes old installation before installing</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline44" class="outline-4">
<h4 id="orgheadline44"><span class="section-number-4">1.7.6</span> Acknowledgments</h4>
<div class="outline-text-4" id="text-1-7-6">
<ul class="org-ul">
<li><span class="underline">Fred Mosselmans</span> noticed that the add a site button didn't work
in Atoms and that a project file saved before a fit is performed
will crash Artemis</li>
<li><span class="underline">Andrei Shiryaev</span> and <span class="underline">Fen Fen Zhu</span> noticed that unicode in
Artemis project files was problematic and <span class="underline">Matt Newville</span>
suggested a solution</li>
<li><span class="underline">Denis Testamale</span> noticed that test 012<sub>atoms</sub> was failing</li>
<li><span class="underline">George Sterbinsky</span> for noting that a fixed edge step value was
not respected for XANES data, for noticing the problem renaming
Athena group names, and for noticing numeric type constraint
issue with Moose&gt;=2.0900.</li>
<li><span class="underline">Eric Breynaert</span> for noticing a crash after discarding a Feff
calculation</li>
<li><span class="underline">Julius Campecino</span> for noticing an inelegant handling of a
situation where running atoms results in 0 scatterers</li>
<li><span class="underline">Karin Provost</span> for the idea of path ranking</li>
<li><span class="underline">Daniel Olive</span> and <span class="underline">Corwin Booth</span> for pointing out that the Booth
self-absorption implementation was horribly flawed</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline46" class="outline-3">
<h3 id="orgheadline46"><span class="section-number-3">1.8</span> 0.9.18.3 28 January   2014</h3>
<div class="outline-text-3" id="text-1-8">
<p>
This is a branch created to facilitate development of the Macports
package.  It has the following changes:
</p>

<ol class="org-ol">
<li>Remove the dependence on Wx::Html and Wx::HtmlEasyPrinting, which
is my suspect for the source of the seg fault</li>

<li>Backport a requirement of MooseX::Types::LaxNum from 0.9.19.
This solves a problem resulting from a recent change to the Moose
object system, which Demeter relies upon.</li>

<li>Backport from HEAD the use of Wx::LaunchDefaultBrowser in
Hephaestus.  This removes the need for Wx::Html and uses the
system browser to display the documentation, which works in
Athena.</li>

<li>Adds the CPAN modules MooseX::Types::LaxNum to the requirements
in Build.PL</li>

<li>Backports from HEAD a page in the Athena Users' Guide and
several image file so that Hephaestus has something to show in the
browser</li>

<li>Backport from HEAD the changes to the datoms script</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline49" class="outline-3">
<h3 id="orgheadline49"><span class="section-number-3">1.9</span> 0.9.18.2 29 August    2013</h3>
<div class="outline-text-3" id="text-1-9">
</div><div id="outline-container-orgheadline47" class="outline-4">
<h4 id="orgheadline47"><span class="section-number-4">1.9.1</span> Artemis</h4>
<div class="outline-text-4" id="text-1-9-1">
<ul class="org-ul">
<li>Fixed several bugs importing old-style artemis projects</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline48" class="outline-4">
<h4 id="orgheadline48"><span class="section-number-4">1.9.2</span> Acknowledgments</h4>
<div class="outline-text-4" id="text-1-9-2">
<ul class="org-ul">
<li><span class="underline">Mattie Peck</span> for reporting these problems importing old-style Artemis projects</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline51" class="outline-3">
<h3 id="orgheadline51"><span class="section-number-3">1.10</span> 0.9.18.1 28 August    2013</h3>
<div class="outline-text-3" id="text-1-10">
</div><div id="outline-container-orgheadline50" class="outline-4">
<h4 id="orgheadline50"><span class="section-number-4">1.10.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-10-1">
<ul class="org-ul">
<li>Fixed a bug involving the order of items in Athena's main menu</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline61" class="outline-3">
<h3 id="orgheadline61"><span class="section-number-3">1.11</span> 0.9.18   27 August    2013</h3>
<div class="outline-text-3" id="text-1-11">
</div><div id="outline-container-orgheadline52" class="outline-4">
<h4 id="orgheadline52"><span class="section-number-4">1.11.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-11-1">
<ul class="org-ul">
<li>Display uncertainties in fitted E0 shifts</li>
<li>fixed an issue making plots via orange and purple buttons with certain tools displayed</li>
<li>Improvements to LCF tool
<ul class="org-ul">
<li>LCF tool: the interaction of individual and over-all e0 shifts now makes sense</li>
<li>linear term in LCF fit disabled when using ifeffit</li>
<li>reorganized widgets on LCF tool, added mouseover hints</li>
</ul></li>
<li>improvements to the peak fitting tool
<ul class="org-ul">
<li>scrolled area now working correctly</li>
<li>now capable of 4-parameter lineshapes</li>
<li>initial guess for step width is core hole lifetime</li>
<li>fit sequence on marked groups</li>
<li>plot of individual parameter values over a sequence</li>
<li>pseudo-Voigt now available from Ifeffit</li>
<li>sanity check of parameter values before fitting</li>
<li>pluck buttons for fit range work</li>
</ul></li>
<li>Applications of white line position finder
<ul class="org-ul">
<li>set e0 to white line top</li>
<li>find + plot (this group) or tabulate (all and marked) white line positions</li>
<li>configuration parameter group for controlling algorithm</li>
</ul></li>
<li>Multi-electron excitation removal tool</li>
<li>Move several items from Group menu to a new Energy menu</li>
<li>fixed a bug that had the red save indicator changing color too quickly</li>
<li>use new list-returning filetype plugin by calling Import recursively after generating the list</li>
<li>up and down, (alt/ctrl)-(j/k) now mapped correctly (j=down, k=up)</li>
<li>fixed a problem importing chi(k) data from an ascii file</li>
<li>in column selection dialog when selecting energy column, Athena rechecks energy units of new selection</li>
<li>plot norm(E) scaled by size of edge step (from Plot menu)</li>
<li>Fixed a PCA bug involving mistakes keeping track of which groups are included in the PCA stack</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline53" class="outline-4">
<h4 id="orgheadline53"><span class="section-number-4">1.11.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-11-2">
<ul class="org-ul">
<li>Benefit by improved pathfinder performance</li>
<li>Clear project name when closing a project</li>
<li>fixed a problem importing data via "Open project or data" in certain situations</li>
<li>temporarily disable any non-critical sanity check for a fit</li>
<li>button for not saving a fit to the history</li>
<li>recognize keep attribute of fit object for finer control over history creation</li>
<li>display contents of misc.dat in Path page header</li>
<li>pathinder-&gt;postcrit parameter to restrict pathlist on intrp page</li>
<li>use new path selection tool on Path page</li>
<li>remove autosave files if user chooses not to import them</li>
<li>data from Athena project file which uses a background removal
standard is now imported correctly along with the data for the
removal standard</li>
<li>add tool for computing bond valence sums from marked path(s)</li>
<li>new pre-fit sanity check to make sure that GDS parameter names only have allowed characters</li>
<li>right click on cards in feff.inp to go directly to the on-line Feff documentation</li>
<li>button to evaluate and display GDS parameter without fitting (i.e. "spell-check" your def parameters)</li>
<li>can now stretch the Data window and adjust the size of the path list</li>
</ul>
</div>
</div>
