Changes.org
*** Demeter
   + switching between ifeffit and larch is more sensible with DEMETER_BACKEND and DEMETER_DEVFLAG environment variables
     - =export DEMETER_BACKEND = ifeffit|larch= to control which backend is used
     - =export DEMETER_DEVFLAG = 0|1= to control whether development screen messages are printed
   + Did some profiling on path finder, found a way to significantly improve performance
   + Added Eric Breynaert's SPEC file plugin for SNBL at ESRF
   + Deal more gracefully with a corrupted MRU file
   + Add interface to bond valence sum database
   + Record uncertainty in E0 shift when auto-aligning
   + Coerce values for weights, e0s, and their uncertainties to numbers in LCF object
   + LCF linear term now works, but only in Larch
   + changed =ifeffit= attribute in Mode object to =backend=
     - made "ifeffit" and "larch" as aliases for "backend"
     - replaced "ifeffit" with "backend" everywhere in the distribution
   + removed dependence on MooseX::StrictConstructor (this addresses a
     problem with backwards compatibility of project files which have
     newly implemented attributes of Demeter objects.  this is not
     actually solvable looking backwards, but should be forwards)
   + improved Dump method in Tools.pm to allow use of Data:Dump::Color or Data::Dump if available
   + Peak fitting improvements
     - collecting statistics in peak fit
     - method for fit sequence over a set of groups
     - deal sensibly with 4-parameter lineshapes
     - implemented pseudo-Voigt function with Ifeffit
     - fixed an ifeffit bug related to e0 shifts in peak fitting that has been plaguing Athena for a long time
     - updated Athena Users' Guide page to explain all the new features
   + deglitching no longer prohibited on datatype=xanes
   + respect the gnuplot->datastyle configuration parameter
   + method for finding peak position of white line, both ifeffit & larch
   + fixed a bug generating paths.dat for a fuzzily degenerate path from a feff.inp with the absorber not at (000)
   + allow file type plugins to return a list of processed files, made Zip.pm to demonstrate
   + keep attribute of Fit object for use in Artemis project creation
   + fixed a bug identifying absorber species in Feff object which manifested for some hand-made feff.inp files
   + multi-electron excitation removal in Demeter::Data::Process
   + =howlong= method in Demeter::Tools + refactored some code to use it
   + document temp and log file locations for A&A

*** Larch
   + Larch templates for LCF fitting
   + Reset symbol table after a call to minimize in Larch templates that do so
   + Larch templates for Peak fitting
   + wrote empirical standard template, but need analysis templates to
     make use of empirical standards, so disabled empirical standard
     export in Athena when larch is in use

*** Wx
   + Fixed a Wx bug involving misuse of the wxNullColour symbol
   + Fixed a trivial display issue when config panel is first opened from plugin registry
   + indicate parameter units in Demeter::UI::Wx::Config more concisely
   + identify backends at GUI startup


*** Top of the to do list 
**** certainly for 0.9.19:
   + Implement dispersive data tool (acknowledgment: Pinit Kidkhunthod)
   + Address several Atoms bugs (acknowledgment: Chanapa Kongmark)
   + Problem with display of $S02 character on some Windows platforms (several)
   + Move all paths between path lists in multile data set fit (acknowledgment: Shelly Kelly)
   + Verify proper performance of Ctrl-DND of paths, update? renamed name preserved?

**** hopefully for 0.9.19:
   + Fuzzy degeneracy over multiple sites (Shelly pushed for this)
   + feff8.5exafs integration (https://github.com/xraypy/feff85exafs)
   + PCA improvements (better TT, indicator functions, cluster analysis)


*** Acknowledgments

With so many new features and bug fixes, I owe a big "Thank You!" to lots of people:

   + _John Hayes_ (reported a PCA bug)
   + _Martin Stennet_ and _Neil Hyatt_ (for requesting the multi-electron excitation tool)
   + _Chachi Rojas_ and _Anthony Ardizzi_ (for bug reports and suggestions regarding to Artemis' fit history)
   + _Shelly Kelly_ (for pointing out bugs involving background removal standards and
     importing chi(k) data  and for suggesting improvements to the Path Interpretation page)
   + _Eric Breyneart_ (for contributing a SPEC file plugin and for reporting a bug in the use of fuzzy degeneracy) 
   + _Alessandra Leri_ (for suggesting the white line finder and its applications, the edge
     step uncertainty tool, and the plot of norm(E) scaled by edge step)
   + _Roberto Rodriguez_ (for reporting a bug involving a corrupted MRU file)
   + _George Strbinsky_ (for reporting bugs in the deglithing tool and in the gnuplot interface)
   + _Joe Woicik_ and others (for noticing several bugs in Artemis' File->Import data menu item)
   + _Shoaib Muhammad_ (for suggesting a change to Artemis' interaction with autosave files
     and for reporting a bug in clearing Feff calculcation when closing projects
   + _Simon Bare_ (for pointing out that (Ctrl/Alt)-(j/k) were implemented inconsistently
   + _Kevin Jorissen_ (for suggesting direct linking to the on-line Feff document)

I think that's everyone.  If I missed your name, it's just that I suck
at record-keeping, not that I don't value your input.

** 0.9.17   28 May       2013
*** Athena
   + Fixed a bug where a column label of "xmu" would cause a definition loop
   + Fixed an issue regarding selection of energy units in column selection dialog
   + Fixed a problem with rebinning parameters not being honored when
     making a rebinned group from the rebin tool or column selection dialog
   + Plotting with E0=0 now respects marked groups normalization button
   + Added a status bar warning when plotting marked groups of different elements

*** Artemis
   + Scrub characters from atom tags that will confuse Feff.  This was
     first seen with a tag with an apostrophe, which confused Feff
     when reading the paths.dat file
   + Fixed a bug whereby creating a VPath would erase the _fit and _res arrays
   + Fixed an error importing non-guess GDS parameters from a dpj (or apj) file
   + Message discouraging use of external feff import
   + Fixed a bug importing external feff calculations related to
     identifying which atoms contribute to the geometry listed in a
     feffNNNN.dat file
   + Attempt a fix to an as-yet unclear problem with a Fit object not
     yet being defined when a fit is run

