Changes.html

<div id="outline-container-orgheadline54" class="outline-4">
<h4 id="orgheadline54"><span class="section-number-4">1.11.3</span> Demeter</h4>
<div class="outline-text-4" id="text-1-11-3">
<ul class="org-ul">
<li>switching between ifeffit and larch is more sensible with DEMETER<sub>BACKEND</sub> and DEMETER<sub>DEVFLAG</sub> environment variables
<ul class="org-ul">
<li><code>export DEMETER_BACKEND = ifeffit|larch</code> to control which backend is used</li>
<li><code>export DEMETER_DEVFLAG = 0|1</code> to control whether development screen messages are printed</li>
</ul></li>
<li>Did some profiling on path finder, found a way to significantly improve performance</li>
<li>Added Eric Breynaert's SPEC file plugin for SNBL at ESRF</li>
<li>Deal more gracefully with a corrupted MRU file</li>
<li>Add interface to bond valence sum database</li>
<li>Record uncertainty in E0 shift when auto-aligning</li>
<li>Coerce values for weights, e0s, and their uncertainties to numbers in LCF object</li>
<li>LCF linear term now works, but only in Larch</li>
<li>changed <code>ifeffit</code> attribute in Mode object to <code>backend</code>
<ul class="org-ul">
<li>made "ifeffit" and "larch" as aliases for "backend"</li>
<li>replaced "ifeffit" with "backend" everywhere in the distribution</li>
</ul></li>
<li>removed dependence on MooseX::StrictConstructor (this addresses a
problem with backwards compatibility of project files which have
newly implemented attributes of Demeter objects.  this is not
actually solvable looking backwards, but should be forwards)</li>
<li>improved Dump method in Tools.pm to allow use of Data:Dump::Color or Data::Dump if available</li>
<li>Peak fitting improvements
<ul class="org-ul">
<li>collecting statistics in peak fit</li>
<li>method for fit sequence over a set of groups</li>
<li>deal sensibly with 4-parameter lineshapes</li>
<li>implemented pseudo-Voigt function with Ifeffit</li>
<li>fixed an ifeffit bug related to e0 shifts in peak fitting that has been plaguing Athena for a long time</li>
<li>updated Athena Users' Guide page to explain all the new features</li>
</ul></li>
<li>deglitching no longer prohibited on datatype=xanes</li>
<li>respect the gnuplot-&gt;datastyle configuration parameter</li>
<li>method for finding peak position of white line, both ifeffit &amp; larch</li>
<li>fixed a bug generating paths.dat for a fuzzily degenerate path from a feff.inp with the absorber not at (000)</li>
<li>allow file type plugins to return a list of processed files, made Zip.pm to demonstrate</li>
<li>keep attribute of Fit object for use in Artemis project creation</li>
<li>fixed a bug identifying absorber species in Feff object which manifested for some hand-made feff.inp files</li>
<li>multi-electron excitation removal in Demeter::Data::Process</li>
<li><code>howlong</code> method in Demeter::Tools + refactored some code to use it</li>
<li>document temp and log file locations for A&amp;A</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline55" class="outline-4">
<h4 id="orgheadline55"><span class="section-number-4">1.11.4</span> Larch</h4>
<div class="outline-text-4" id="text-1-11-4">
<ul class="org-ul">
<li>Larch templates for LCF fitting</li>
<li>Reset symbol table after a call to minimize in Larch templates that do so</li>
<li>Larch templates for Peak fitting</li>
<li>wrote empirical standard template, but need analysis templates to
make use of empirical standards, so disabled empirical standard
export in Athena when larch is in use</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline56" class="outline-4">
<h4 id="orgheadline56"><span class="section-number-4">1.11.5</span> Wx</h4>
<div class="outline-text-4" id="text-1-11-5">
<ul class="org-ul">
<li>Fixed a Wx bug involving misuse of the wxNullColour symbol</li>
<li>Fixed a trivial display issue when config panel is first opened from plugin registry</li>
<li>indicate parameter units in Demeter::UI::Wx::Config more concisely</li>
<li>identify backends at GUI startup</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline59" class="outline-4">
<h4 id="orgheadline59"><span class="section-number-4">1.11.6</span> Top of the to do list</h4>
<div class="outline-text-4" id="text-1-11-6">
</div><ol class="org-ol"><li><a id="orgheadline57"></a>certainly for 0.9.19:<br  /><div class="outline-text-5" id="text-1-11-6-1">
<ul class="org-ul">
<li>Implement dispersive data tool (acknowledgment: Pinit Kidkhunthod)</li>
<li>Address several Atoms bugs (acknowledgment: Chanapa Kongmark)</li>
<li>Problem with display of $S02 character on some Windows platforms (several)</li>
<li>Move all paths between path lists in multile data set fit (acknowledgment: Shelly Kelly)</li>
<li>Verify proper performance of Ctrl-DND of paths, update? renamed name preserved?</li>
</ul>
</div></li>

<li><a id="orgheadline58"></a>hopefully for 0.9.19:<br  /><div class="outline-text-5" id="text-1-11-6-2">
<ul class="org-ul">
<li>Fuzzy degeneracy over multiple sites (Shelly pushed for this)</li>
<li>feff8.5exafs integration (<a href="https://github.com/xraypy/feff85exafs">https://github.com/xraypy/feff85exafs</a>)</li>
<li>PCA improvements (better TT, indicator functions, cluster analysis)</li>
</ul>
</div></li></ol>
</div>


<div id="outline-container-orgheadline60" class="outline-4">
<h4 id="orgheadline60"><span class="section-number-4">1.11.7</span> Acknowledgments</h4>
<div class="outline-text-4" id="text-1-11-7">
<p>
With so many new features and bug fixes, I owe a big "Thank You!" to lots of people:
</p>

<ul class="org-ul">
<li><span class="underline">John Hayes</span> (reported a PCA bug)</li>
<li><span class="underline">Martin Stennet</span> and <span class="underline">Neil Hyatt</span> (for requesting the multi-electron excitation tool)</li>
<li><span class="underline">Chachi Rojas</span> and <span class="underline">Anthony Ardizzi</span> (for bug reports and suggestions regarding to Artemis' fit history)</li>
<li><span class="underline">Shelly Kelly</span> (for pointing out bugs involving background removal standards and
importing chi(k) data  and for suggesting improvements to the Path Interpretation page)</li>
<li><span class="underline">Eric Breyneart</span> (for contributing a SPEC file plugin and for reporting a bug in the use of fuzzy degeneracy)</li>
<li><span class="underline">Alessandra Leri</span> (for suggesting the white line finder and its applications, the edge
step uncertainty tool, and the plot of norm(E) scaled by edge step)</li>
<li><span class="underline">Roberto Rodriguez</span> (for reporting a bug involving a corrupted MRU file)</li>
<li><span class="underline">George Strbinsky</span> (for reporting bugs in the deglithing tool and in the gnuplot interface)</li>
<li><span class="underline">Joe Woicik</span> and others (for noticing several bugs in Artemis' File-&gt;Import data menu item)</li>
<li><span class="underline">Shoaib Muhammad</span> (for suggesting a change to Artemis' interaction with autosave files
and for reporting a bug in clearing Feff calculcation when closing projects</li>
<li><span class="underline">Simon Bare</span> (for pointing out that (Ctrl/Alt)-(j/k) were implemented inconsistently</li>
<li><span class="underline">Kevin Jorissen</span> (for suggesting direct linking to the on-line Feff document)</li>
</ul>

<p>
I think that's everyone.  If I missed your name, it's just that I suck
at record-keeping, not that I don't value your input.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline65" class="outline-3">
<h3 id="orgheadline65"><span class="section-number-3">1.12</span> 0.9.17   28 May       2013</h3>
<div class="outline-text-3" id="text-1-12">
</div><div id="outline-container-orgheadline62" class="outline-4">
<h4 id="orgheadline62"><span class="section-number-4">1.12.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-12-1">
<ul class="org-ul">
<li>Fixed a bug where a column label of "xmu" would cause a definition loop</li>
<li>Fixed an issue regarding selection of energy units in column selection dialog</li>
<li>Fixed a problem with rebinning parameters not being honored when
making a rebinned group from the rebin tool or column selection dialog</li>
<li>Plotting with E0=0 now respects marked groups normalization button</li>
<li>Added a status bar warning when plotting marked groups of different elements</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline63" class="outline-4">
<h4 id="orgheadline63"><span class="section-number-4">1.12.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-12-2">
<ul class="org-ul">
<li>Scrub characters from atom tags that will confuse Feff.  This was
first seen with a tag with an apostrophe, which confused Feff
when reading the paths.dat file</li>
<li>Fixed a bug whereby creating a VPath would erase the _fit and _res arrays</li>
<li>Fixed an error importing non-guess GDS parameters from a dpj (or apj) file</li>
<li>Message discouraging use of external feff import</li>
<li>Fixed a bug importing external feff calculations related to
identifying which atoms contribute to the geometry listed in a
feffNNNN.dat file</li>
<li>Attempt a fix to an as-yet unclear problem with a Fit object not
yet being defined when a fit is run</li>
</ul>
</div>
</div>
