Changes.org
*** Demeter
   + Lots more Larch templates
   + updater.iss now includes more things, including Ifefgfit.dll

** 0.9.16   28 March     2013
*** Athena
   + fixed a couple bugs in difference spectrum tool
   + fixed an error importing data+reference when the energy column is
     something other than column 1.
   + align using smoothed derivative is now the default for both
     preprocessing and for the alignment tool
   + fixed an issue involving import of chi(k) from column data file
   + improvements to difference spectrum tool

*** Artemis
   + phase corrected transforms implemented
   + turn off indicators for Rk plot
   + better documentation for PC plots

*** Hephaestus
   + fixed an error precluding the formulas tool from reporting the
     penetration depth for a unit edge step for a nearby edge

*** Demeter
   + rebinning was ridiculously broken
   + much progress on Larch templates
   + fixed an issue surrounding the conditional loading of either
     Ifeffit.pm or Larch.pm
   + added a new unit test file 023_miscellany
   + fixed a bug bringing data up to date before calling write_many

** 0.9.15   21 February  2013
*** Athena
   - manage update flags in a much better way, making Athena much
     snappier by reducing the number of calls to pre_edge() and
     autobk()
   - Interface to Athena Users' Guide from within Athena via browser
   - Improved plucking from gnuplot window, the interaction is much
     more natural -- no intermediate dialog window
   - Implemented Data Summation tool
   - menu items for sending last plot to png or pdf file
   - compute ave/stddev when presenting a parameter table
   - LCF sequence report button no longer mistakenly disabled after
     sequence
   - corrected a bug in which many Peak Fitting buttons could become
     irreparably disabled
   - editing journal sets save indicator on
   - fixed a bug related to importing reference channels for multiple
     files
   - command line switches to aid in larch integration

*** Artemis
   - Interface to Artemis Users' Guide from within Artemis via browser
   - menu items for sending last plot to png or pdf file
   - added right click context menu to the items in the Data and Feff
     lists
   - fixed the fit sanity checker to notice if a data set has been
     excluded from the fit and not run sanity checks on it or its
     paths.
   - improved identification of paths in fit sanity checking and in
     GDS find function
   - added menu item for saving current fit to a project (i.e. current
     fit without history)
   - added Plot menu items for turning on and off plot_after for all
     data sets
   - more sensible default for Data plot_after_fit parameter
   - unfreeze data as imported from an Athena project file
   - better error message for paths outside of fintting Rmax
   - can enlarge GDS window vertically
   - tab order set sensibly between path parameter text boxes on Path
     page
   - data plot_after flags managed more sensibly in a MDS fit
   - fit history enhancements
   - can save current fit to a project without history (good for bug
     reports!)

*** Demeter
   - Begin work on Larch integration, normally disabled
   - mirroring repository at Bitbucket
   - send gnuplot plot to file terminal type with special
     configuration for PDF terminal and no real support for many of
     the terminal types.  Gif and jpg, for instance, look like crap.
   - Install Artemis Users' Guide into Demeter/UI/Artemis/share
   - added code to DemeterBuilder.pm to build artug reliably even on
     Windows
   - added data summation recipe
   - correct legend keys for R123 plots
   - made Demeter::UI::Wx::VerbDialog -- a generic yes/no dialog using
     a specified verb on the yes button
   - configurable column numbers in X15B plugin

** 0.9.14    2 January   2013
*** Athena
   - Plot indicators when plotting from deglitch tool
   - Filename for combinatorial output spreadsheet uses group name
   - Fixed a bug causing a crash in LCF tool related to recent
     renaming of fit sequence report.
   - Fixed several problems interacting with the results of a fit
     sequence
   - Improvements to copy series tool: busy cursor, plot
     appropriately, compute avg and stddev of edge steps for norm
     parameters
   - Implemented deglitching by margins
   - Reset smoothing parameter after plot or fit in the align tool 
   - Constraining parameters no longer pushed value of bkg_eshift
   - Difference spectra:
      + can be made of mu, norm, deriv, second, norm/deriv, and
        norm/second.  norm is the default
      + marked groups functionality
      + made groups naming template
   - Implemented functionality for difference of marked groups
   - Calculation of approximate uncertainty in edge step
   - Set E0 of all/marked groups using an algorithm, see Group menu
   - Added a specified multiplicative constant in the column selection
     dialog and its persistence file
   - Fixed a column selection bug: when importing multi-column data
     with the each column button ticked on along with a reference
     spectrum, each group (one per column) will get a reference
     spectrum.  The reference is now cloned for each group.
     Previously, each reference group pointed at the same Ifeffit data
     group.  Removing one reference group from an Athena project
     would remove the Ifeffit group, leaving the remaining copies
     unplottable.  By cloning, the reference groups are now completely
     independent.
   - Fixed a problem in the column selection dialog when specifying no
     denominator for the reference channel
   - Added smoothing tool with various smoothing options

