Changes.html

<div id="outline-container-orgheadline64" class="outline-4">
<h4 id="orgheadline64"><span class="section-number-4">1.12.3</span> Demeter</h4>
<div class="outline-text-4" id="text-1-12-3">
<ul class="org-ul">
<li>Lots more Larch templates</li>
<li>updater.iss now includes more things, including Ifefgfit.dll</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline70" class="outline-3">
<h3 id="orgheadline70"><span class="section-number-3">1.13</span> 0.9.16   28 March     2013</h3>
<div class="outline-text-3" id="text-1-13">
</div><div id="outline-container-orgheadline66" class="outline-4">
<h4 id="orgheadline66"><span class="section-number-4">1.13.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-13-1">
<ul class="org-ul">
<li>fixed a couple bugs in difference spectrum tool</li>
<li>fixed an error importing data+reference when the energy column is
something other than column 1.</li>
<li>align using smoothed derivative is now the default for both
preprocessing and for the alignment tool</li>
<li>fixed an issue involving import of chi(k) from column data file</li>
<li>improvements to difference spectrum tool</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline67" class="outline-4">
<h4 id="orgheadline67"><span class="section-number-4">1.13.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-13-2">
<ul class="org-ul">
<li>phase corrected transforms implemented</li>
<li>turn off indicators for Rk plot</li>
<li>better documentation for PC plots</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline68" class="outline-4">
<h4 id="orgheadline68"><span class="section-number-4">1.13.3</span> Hephaestus</h4>
<div class="outline-text-4" id="text-1-13-3">
<ul class="org-ul">
<li>fixed an error precluding the formulas tool from reporting the
penetration depth for a unit edge step for a nearby edge</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline69" class="outline-4">
<h4 id="orgheadline69"><span class="section-number-4">1.13.4</span> Demeter</h4>
<div class="outline-text-4" id="text-1-13-4">
<ul class="org-ul">
<li>rebinning was ridiculously broken</li>
<li>much progress on Larch templates</li>
<li>fixed an issue surrounding the conditional loading of either
Ifeffit.pm or Larch.pm</li>
<li>added a new unit test file 023<sub>miscellany</sub></li>
<li>fixed a bug bringing data up to date before calling write<sub>many</sub></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline74" class="outline-3">
<h3 id="orgheadline74"><span class="section-number-3">1.14</span> 0.9.15   21 February  2013</h3>
<div class="outline-text-3" id="text-1-14">
</div><div id="outline-container-orgheadline71" class="outline-4">
<h4 id="orgheadline71"><span class="section-number-4">1.14.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-14-1">
<ul class="org-ul">
<li>manage update flags in a much better way, making Athena much
snappier by reducing the number of calls to pre<sub>edge</sub>() and
autobk()</li>
<li>Interface to Athena Users' Guide from within Athena via browser</li>
<li>Improved plucking from gnuplot window, the interaction is much
more natural &#x2013; no intermediate dialog window</li>
<li>Implemented Data Summation tool</li>
<li>menu items for sending last plot to png or pdf file</li>
<li>compute ave/stddev when presenting a parameter table</li>
<li>LCF sequence report button no longer mistakenly disabled after
sequence</li>
<li>corrected a bug in which many Peak Fitting buttons could become
irreparably disabled</li>
<li>editing journal sets save indicator on</li>
<li>fixed a bug related to importing reference channels for multiple
files</li>
<li>command line switches to aid in larch integration</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline72" class="outline-4">
<h4 id="orgheadline72"><span class="section-number-4">1.14.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-14-2">
<ul class="org-ul">
<li>Interface to Artemis Users' Guide from within Artemis via browser</li>
<li>menu items for sending last plot to png or pdf file</li>
<li>added right click context menu to the items in the Data and Feff
lists</li>
<li>fixed the fit sanity checker to notice if a data set has been
excluded from the fit and not run sanity checks on it or its
paths.</li>
<li>improved identification of paths in fit sanity checking and in
GDS find function</li>
<li>added menu item for saving current fit to a project (i.e. current
fit without history)</li>
<li>added Plot menu items for turning on and off plot<sub>after</sub> for all
data sets</li>
<li>more sensible default for Data plot<sub>after</sub><sub>fit</sub> parameter</li>
<li>unfreeze data as imported from an Athena project file</li>
<li>better error message for paths outside of fintting Rmax</li>
<li>can enlarge GDS window vertically</li>
<li>tab order set sensibly between path parameter text boxes on Path
page</li>
<li>data plot<sub>after</sub> flags managed more sensibly in a MDS fit</li>
<li>fit history enhancements</li>
<li>can save current fit to a project without history (good for bug
reports!)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline73" class="outline-4">
<h4 id="orgheadline73"><span class="section-number-4">1.14.3</span> Demeter</h4>
<div class="outline-text-4" id="text-1-14-3">
<ul class="org-ul">
<li>Begin work on Larch integration, normally disabled</li>
<li>mirroring repository at Bitbucket</li>
<li>send gnuplot plot to file terminal type with special
configuration for PDF terminal and no real support for many of
the terminal types.  Gif and jpg, for instance, look like crap.</li>
<li>Install Artemis Users' Guide into Demeter/UI/Artemis/share</li>
<li>added code to DemeterBuilder.pm to build artug reliably even on
Windows</li>
<li>added data summation recipe</li>
<li>correct legend keys for R123 plots</li>
<li>made Demeter::UI::Wx::VerbDialog &#x2013; a generic yes/no dialog using
a specified verb on the yes button</li>
<li>configurable column numbers in X15B plugin</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline81" class="outline-3">
<h3 id="orgheadline81"><span class="section-number-3">1.15</span> 0.9.14    2 January   2013</h3>
<div class="outline-text-3" id="text-1-15">
</div><div id="outline-container-orgheadline75" class="outline-4">
<h4 id="orgheadline75"><span class="section-number-4">1.15.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-15-1">
<ul class="org-ul">
<li>Plot indicators when plotting from deglitch tool</li>
<li>Filename for combinatorial output spreadsheet uses group name</li>
<li>Fixed a bug causing a crash in LCF tool related to recent
renaming of fit sequence report.</li>
<li>Fixed several problems interacting with the results of a fit
sequence</li>
<li>Improvements to copy series tool: busy cursor, plot
appropriately, compute avg and stddev of edge steps for norm
parameters</li>
<li>Implemented deglitching by margins</li>
<li>Reset smoothing parameter after plot or fit in the align tool</li>
<li>Constraining parameters no longer pushed value of bkg<sub>eshift</sub></li>
<li>Difference spectra:
<ul class="org-ul">
<li>can be made of mu, norm, deriv, second, norm/deriv, and
norm/second.  norm is the default</li>
<li>marked groups functionality</li>
<li>made groups naming template</li>
</ul></li>
<li>Implemented functionality for difference of marked groups</li>
<li>Calculation of approximate uncertainty in edge step</li>
<li>Set E0 of all/marked groups using an algorithm, see Group menu</li>
<li>Added a specified multiplicative constant in the column selection
dialog and its persistence file</li>
<li>Fixed a column selection bug: when importing multi-column data
with the each column button ticked on along with a reference
spectrum, each group (one per column) will get a reference
spectrum.  The reference is now cloned for each group.
Previously, each reference group pointed at the same Ifeffit data
group.  Removing one reference group from an Athena project
would remove the Ifeffit group, leaving the remaining copies
unplottable.  By cloning, the reference groups are now completely
independent.</li>
<li>Fixed a problem in the column selection dialog when specifying no
denominator for the reference channel</li>
<li>Added smoothing tool with various smoothing options</li>
</ul>
</div>
</div>
