Changes.org
*** Artemis
   - LOTS of work on Users' Guide
   - fixed a problem where crystal data entered by hand got flagged as
     unused, resulting in crashy behavior when running Atoms
   - Fixed a bug causing a crash when restoring a fit from the fit
     history
   - Plot history tool now seems to be working
      + Notice if a historical item is already in the Plot list 
      + Import fit history from a project in a way that allows the
        plot tool to work *and* imports sufficiently quickly
   - Corrected a problem plotting immediately after importing a
     project with a fitting model but without a fit having been run
   - log file shows R-factor by k-weight for MDS fit
   - corrected a problem importing a project with a Feff calculation
     having a disabled Atoms tab (i.e. one which started from a
     feff.inp file)
   - Data toggle buttons now display Show/Hide correctly as
     data/project imported

*** Atoms
   - fixed a crashy problem in getting space group symbol from some
     CIF files
   - menu and keyboard controls for moving between tabs in stand-alone
   - improved CIF parsing by making the tags case insensitive.  this
     was done by redefining a STAR::DataBlock method in the
     Demeter::Atoms::CIF file
   - fixed a display issue with very recent Wx -- needed to
     SetSizerAndFit in make_feff_frame to fully size the Atoms page

*** Hephaestus
   - Display wavelengths in several places where energies are displayed
   - Rewrote document and reimplemented Document tool
   - Keyboard shortcuts for moving between tools

*** Demeter
   - Nicer looking plot indicators in gnuplot backend (now plot as
     full y-scale in graph)
   - Fixed a bug recording title lines from feff.inp files.  This was
     not causing a problem running or using feff, but it was causing
     two test failures
   - added the fit -> zeros template to correct a problem importing a
     project with a fitting model but no fit
   - Demeter::UI::Artemis::ShowText now has a save button
   - added EdgeStep recipe
   - plot margins
   - Diff object, flags for disabling integration + setting datatype,
     use indicators rather markers in plots
   - fixed an error recognizing a double click in the gnuplot cursor
     interface
   - fixed an erf/erfc typo resulting in problems doing peak fitting
     with error function
   - more robust Demeter::Diff object, dynamic naming of derived Data
     objects
   - added multiplier attribute to the Data object
   - At build, do a simple test to determine if gnuplot is present on
     the system and modify 'plot.demeter_conf' accordingly.  This
     works for new installations, it will not retrofit an existing
     installation.  In that case, user should modify "plot->plotwith".
   - Fixed an issue with Wx::FileDialog on Ubuntu 12.10 --
     GetDirectory returns the wrong thing, use GetPath instead
   - compute R-factor by k-weight per data set after an MDS fit
   - Added smoothing of data by boxcar average, Gaussian filter
   - Corrected spurious warnings in t/005_plot.t and t/016_fspath.t

*** Windows
   - downgraded to Ifeffit 1.2.11d to correct a problem in how Ifeffit
     got compiled.  I did, however, apply the patch to Feff6 allowing
     it to compute up to element 96.
   - added a work-around in the BEGIN block of each item in bin/
     folder to deal with the MinGW version skew problem on Windows
     caused by having some MinGW location in the PATH before the
     various strawberry entries.
   - added more information to the log files written by the GUI
     programs

** 0.9.13    2 October   2012
*** Athena
   - Updated the HXMA plugin
   - Attempt to deal better with unreadable data file by bailing out
     before the column selection dialog

*** Artemis
   - read files.dat from old-style fit serialization so that path
     ranking can be done
   - projects with quick first shell paths now imported properly
   - display warning about excessively long QFS distances in a better
     manner

*** Demeter
   - Coerce numbers 0-5 into sensible window functions in
     Demeter::StrTypes for Demeter::Data
   - save files.dat (if it exists) to the fit serialization
   - removed several images from repository
   - error attribute for FSPath object to facilitate warning reporting
     in Artemis
   - spiffier product page at github

*** Windows
   - Implemented updater packages using Inno and wrapping up the
     entire Demeter folder under {app}\perl\site\lib\.  Also added
     Inno script updater.iss to repo

** 0.9.12   26 September 2012
*** Athena
   - Fixed a crashy bug when changing normalization order
   - Flag for setting difference group as re-normalizable
   - Fix bugs in selecting XANES as datatype in column selection
     dialog

*** Artemis
   - P1 output from Atoms now correctly sets space group as "P 1"
   - Better (and less crashy) error message in case of multiple
     occupancy in crystal data
   - Fixed a problem importing a project file containing only a feff
     calclation and no data
   - Fits folder underneath project folder was not cleaned out when
     closing a project
   - Plot space is set correctly on intrp tab

*** Demeter
   - Added CONTRIBUTING file to distro for use at GitHub

** 0.9.11   18 September 2012
*** Athena
   - Self absorption: plot information depth in energy and check to be
     sure that absorber is in the formula
   - Fixed a bug reading data files with very line column label lines
   - Added a filetype plugin for LNLS data files
   - Fixed a bug where edge step value may not have been updated after
     a plot
   - Correctly import reference spectra of a different edge from the
     data

*** Artemis
   - fixed a bug in Artemis' quick first shell interface to allow Am
     through Cf as absorbers (although Feff only allows up to Cm)
   - fixed some problems related to importing old-style Artemis
     projects
   - Control-w now hides Data window
   - Implement use of path ranking

