Changes.html

<div id="outline-container-orgheadline76" class="outline-4">
<h4 id="orgheadline76"><span class="section-number-4">1.15.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-15-2">
<ul class="org-ul">
<li>LOTS of work on Users' Guide</li>
<li>fixed a problem where crystal data entered by hand got flagged as
unused, resulting in crashy behavior when running Atoms</li>
<li>Fixed a bug causing a crash when restoring a fit from the fit
history</li>
<li>Plot history tool now seems to be working
<ul class="org-ul">
<li>Notice if a historical item is already in the Plot list</li>
<li>Import fit history from a project in a way that allows the
plot tool to work <b>and</b> imports sufficiently quickly</li>
</ul></li>
<li>Corrected a problem plotting immediately after importing a
project with a fitting model but without a fit having been run</li>
<li>log file shows R-factor by k-weight for MDS fit</li>
<li>corrected a problem importing a project with a Feff calculation
having a disabled Atoms tab (i.e. one which started from a
feff.inp file)</li>
<li>Data toggle buttons now display Show/Hide correctly as
data/project imported</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline77" class="outline-4">
<h4 id="orgheadline77"><span class="section-number-4">1.15.3</span> Atoms</h4>
<div class="outline-text-4" id="text-1-15-3">
<ul class="org-ul">
<li>fixed a crashy problem in getting space group symbol from some
CIF files</li>
<li>menu and keyboard controls for moving between tabs in stand-alone</li>
<li>improved CIF parsing by making the tags case insensitive.  this
was done by redefining a STAR::DataBlock method in the
Demeter::Atoms::CIF file</li>
<li>fixed a display issue with very recent Wx &#x2013; needed to
SetSizerAndFit in make<sub>feff</sub><sub>frame</sub> to fully size the Atoms page</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline78" class="outline-4">
<h4 id="orgheadline78"><span class="section-number-4">1.15.4</span> Hephaestus</h4>
<div class="outline-text-4" id="text-1-15-4">
<ul class="org-ul">
<li>Display wavelengths in several places where energies are displayed</li>
<li>Rewrote document and reimplemented Document tool</li>
<li>Keyboard shortcuts for moving between tools</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline79" class="outline-4">
<h4 id="orgheadline79"><span class="section-number-4">1.15.5</span> Demeter</h4>
<div class="outline-text-4" id="text-1-15-5">
<ul class="org-ul">
<li>Nicer looking plot indicators in gnuplot backend (now plot as
full y-scale in graph)</li>
<li>Fixed a bug recording title lines from feff.inp files.  This was
not causing a problem running or using feff, but it was causing
two test failures</li>
<li>added the fit -&gt; zeros template to correct a problem importing a
project with a fitting model but no fit</li>
<li>Demeter::UI::Artemis::ShowText now has a save button</li>
<li>added EdgeStep recipe</li>
<li>plot margins</li>
<li>Diff object, flags for disabling integration + setting datatype,
use indicators rather markers in plots</li>
<li>fixed an error recognizing a double click in the gnuplot cursor
interface</li>
<li>fixed an erf/erfc typo resulting in problems doing peak fitting
with error function</li>
<li>more robust Demeter::Diff object, dynamic naming of derived Data
objects</li>
<li>added multiplier attribute to the Data object</li>
<li>At build, do a simple test to determine if gnuplot is present on
the system and modify 'plot.demeter<sub>conf</sub>' accordingly.  This
works for new installations, it will not retrofit an existing
installation.  In that case, user should modify "plot-&gt;plotwith".</li>
<li>Fixed an issue with Wx::FileDialog on Ubuntu 12.10 &#x2013;
GetDirectory returns the wrong thing, use GetPath instead</li>
<li>compute R-factor by k-weight per data set after an MDS fit</li>
<li>Added smoothing of data by boxcar average, Gaussian filter</li>
<li>Corrected spurious warnings in t/005<sub>plot.t</sub> and t/016<sub>fspath.t</sub></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline80" class="outline-4">
<h4 id="orgheadline80"><span class="section-number-4">1.15.6</span> Windows</h4>
<div class="outline-text-4" id="text-1-15-6">
<ul class="org-ul">
<li>downgraded to Ifeffit 1.2.11d to correct a problem in how Ifeffit
got compiled.  I did, however, apply the patch to Feff6 allowing
it to compute up to element 96.</li>
<li>added a work-around in the BEGIN block of each item in bin/
folder to deal with the MinGW version skew problem on Windows
caused by having some MinGW location in the PATH before the
various strawberry entries.</li>
<li>added more information to the log files written by the GUI
programs</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline86" class="outline-3">
<h3 id="orgheadline86"><span class="section-number-3">1.16</span> 0.9.13    2 October   2012</h3>
<div class="outline-text-3" id="text-1-16">
</div><div id="outline-container-orgheadline82" class="outline-4">
<h4 id="orgheadline82"><span class="section-number-4">1.16.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-16-1">
<ul class="org-ul">
<li>Updated the HXMA plugin</li>
<li>Attempt to deal better with unreadable data file by bailing out
before the column selection dialog</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline83" class="outline-4">
<h4 id="orgheadline83"><span class="section-number-4">1.16.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-16-2">
<ul class="org-ul">
<li>read files.dat from old-style fit serialization so that path
ranking can be done</li>
<li>projects with quick first shell paths now imported properly</li>
<li>display warning about excessively long QFS distances in a better
manner</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline84" class="outline-4">
<h4 id="orgheadline84"><span class="section-number-4">1.16.3</span> Demeter</h4>
<div class="outline-text-4" id="text-1-16-3">
<ul class="org-ul">
<li>Coerce numbers 0-5 into sensible window functions in
Demeter::StrTypes for Demeter::Data</li>
<li>save files.dat (if it exists) to the fit serialization</li>
<li>removed several images from repository</li>
<li>error attribute for FSPath object to facilitate warning reporting
in Artemis</li>
<li>spiffier product page at github</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline85" class="outline-4">
<h4 id="orgheadline85"><span class="section-number-4">1.16.4</span> Windows</h4>
<div class="outline-text-4" id="text-1-16-4">
<ul class="org-ul">
<li>Implemented updater packages using Inno and wrapping up the
entire Demeter folder under {app}\perl\site\lib\.  Also added
Inno script updater.iss to repo</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline90" class="outline-3">
<h3 id="orgheadline90"><span class="section-number-3">1.17</span> 0.9.12   26 September 2012</h3>
<div class="outline-text-3" id="text-1-17">
</div><div id="outline-container-orgheadline87" class="outline-4">
<h4 id="orgheadline87"><span class="section-number-4">1.17.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-17-1">
<ul class="org-ul">
<li>Fixed a crashy bug when changing normalization order</li>
<li>Flag for setting difference group as re-normalizable</li>
<li>Fix bugs in selecting XANES as datatype in column selection
dialog</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline88" class="outline-4">
<h4 id="orgheadline88"><span class="section-number-4">1.17.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-17-2">
<ul class="org-ul">
<li>P1 output from Atoms now correctly sets space group as "P 1"</li>
<li>Better (and less crashy) error message in case of multiple
occupancy in crystal data</li>
<li>Fixed a problem importing a project file containing only a feff
calclation and no data</li>
<li>Fits folder underneath project folder was not cleaned out when
closing a project</li>
<li>Plot space is set correctly on intrp tab</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline89" class="outline-4">
<h4 id="orgheadline89"><span class="section-number-4">1.17.3</span> Demeter</h4>
<div class="outline-text-4" id="text-1-17-3">
<ul class="org-ul">
<li>Added CONTRIBUTING file to distro for use at GitHub</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline96" class="outline-3">
<h3 id="orgheadline96"><span class="section-number-3">1.18</span> 0.9.11   18 September 2012</h3>
<div class="outline-text-3" id="text-1-18">
</div><div id="outline-container-orgheadline91" class="outline-4">
<h4 id="orgheadline91"><span class="section-number-4">1.18.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-18-1">
<ul class="org-ul">
<li>Self absorption: plot information depth in energy and check to be
sure that absorber is in the formula</li>
<li>Fixed a bug reading data files with very line column label lines</li>
<li>Added a filetype plugin for LNLS data files</li>
<li>Fixed a bug where edge step value may not have been updated after
a plot</li>
<li>Correctly import reference spectra of a different edge from the
data</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline92" class="outline-4">
<h4 id="orgheadline92"><span class="section-number-4">1.18.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-18-2">
<ul class="org-ul">
<li>fixed a bug in Artemis' quick first shell interface to allow Am
through Cf as absorbers (although Feff only allows up to Cm)</li>
<li>fixed some problems related to importing old-style Artemis
projects</li>
<li>Control-w now hides Data window</li>
<li>Implement use of path ranking</li>
</ul>
</div>
</div>
