Changes.org
*** Demeter
   - dispense method at a wrapper around dispose and template
   - chart method at a wrapper around dispose and template for plotting
   - several new templates to abstract out direct calls to Ifeffit in
     preparation for Larch integration
   - fixed bugs in how rebinning parameters were determined and used
   - extensive preparation for Larch
   - added a test for clear_ifeffit_methods in 004_data.t
   - fixed several bugs in difference spectrum calculation
   - fixed various problems involving the use of rebin parameters
   - framework for path ranking
   - Better values of Type attribute for FPath and FSPath

*** Windows
   - updated to most recent Ifeffit from github + patched Feff6L to
     allow Am and Cm as absorbers
   - fixed a problem following shortcuts into folders in certain
     situations
   - explicitly call demeter's version of perl from BAT files, this
     invloved a post-installation script run by Inno

*** Acknowledgements for this release
   - Eric Breynaert
   - Shelly Kelly
   - Karine Provost
   - Andreas Voegelin
   - Amy Gandy
   - Bradley Miller
   - Jason Gaudet
   - Alfred Hummer
   - Daniel Whittaker
   - Matt Frith
   - The participants of the 2012 ASEAN Workshop on XAS

** 0.9.10   17 July      2012
*** Athena
   - Improved X23A2 and HXMA plugins
   - Add a select range button to column selection dialog to help
     process data with a large number of columns (e.g. NSLS X3b)
   - Fixed a bug involving the import plot for the first item in a prj
     file when that group uses a background removal standard
   - File selection dialog presents plotting options based on the
     datatype of the selection, also chooses sensible fallback
     plotting selection
   - Generic utility for presenting a table of a single parameter
     value.  Context menu entries for this under energy shift and edge
     step labels.
   - Recognize if data sets included in a merge are substantially
     shorter than the first set in the group.  If so, exclude them
     from the merge.  Made configuration parameters for defining how
     much shorter and whether to exclude.
   - Fixed behavior of up arrow for Athena's string entry dialogs that
     have buffers.  The first time pressing up arrow went to an
     unpredictable part of the buffer.  It now will go to the most
     recent entry.
   - Force dk and dr to 0 when making empirical standards.

*** Artemis
   - Display a useful error message when the phase.bin file is not
     computed correctly.  Also clear and do not display intrp tab.
   - Take care to update paths in Artemis before beginning fit so that
     everything (i.e. FPaths) passes sanity checks
   - Sentinals now work correctly in Artemis for all histogram
     functions so that useful updates get written to Data frame
     statusbar
   - Fixed several display issues
   - Correctly add a new row when using the restraint builder
   - Save initial guesses of GDS parameters to a project and restore
     them
   - Fit description updated (crudely) when data are replaced
   - Fixed a bug when discarding a Feff calculation before any paths
     have been assigned to a data set
   - Fixed (I think) a crashy bug when removing GDS parameters
   - Fixed a bug involving the import of data from a prj file when
     that group uses a background removal standard
   - Ignore data from an Athena project file that cannot be displayed
     as chi(k), e.g. XANES data.
   - Correctly initialize row on GDS page whenever a new parameter is
     created

*** Atoms
   - Disable path DnD for stand-alone Atoms
   - Added a right click action to the paths list to display details
     of scattering geometry

*** Hephaestus
   - Prevent notebook from capturing carriage return on Windows

*** Demeter
   - Convert histogram calculations to use PDL -- much faster!
     (backends: LAMMPS, )
   - Fixed a bug building the ifeffit wrapper
   - Improved installation.pod
   - Changed default gnuplot color #4 to yellow4 (#808000)
   - Added window functions to Rk plot
   - Made ed plot
   - Begin Artemis Users' Guide
   - Prefer the Co K edge to the Re L3 edge when finding the edge (is
     that the right choice?)

** 0.9.9    20 April     2012
*** Athena
   - Delay laying out most windows until needed for the first time.
     This speed up startup at the cost of a bit more time later on.
     Start-up went from about 6 1/2 sec to under 4 seconds on my work
     computer
   - Mostly functional file watcher + added functionality to IO methods
   - Importance was not being imported from a project file
   - Made the importance control normal width
   - Added athena->interactive_fixstep configuration parameter for
     disabling the interaction between pre-edge, normalization, and
     edge step controls and the fixstep button.
   - when importing a sequence of files and one cannot be imported
     (e.g. aborted scan) offer to continue or quit importing sequence
   - XDI as a known file extension when importing data
   - Importance and plot_multiplier functionality for bent Laue data
     from 10ID
   - Return to main button was being displayed incorrectly
   - Found a normalization bug in Ifeffit, norm_order not respected in
     call to spline().  Submitted patch to Matt.
   - Smooth works in Calibrate tool
   - Visual feedback when element < 5 or E0 < 150
   - Implemented a spin button for incrementing/deincrementing Rbkg
   - Attempt to recognize data with a zero value in the denominator
   - Implemented frozen groups + Freeze menu + Athena->frozen config
     parameter for color of frozen group display + button
   - Display of peak fitting page is functuional (but not quite right)
     even on Windows.
   - Fixed a column selection bug involving the "import each channel"
     button
   - Edge step was not reliably updated after a new plot

*** Artemis
   - Fixed (mostly) a bug laying out Atoms/Feff notebook tabs when
     importing a project file.
   - Fixed a sanity check that got incorrectly triggered when
     replacing data with the same data (for example, after going back
     to Athena to adjust E0)
   - Fixed a problem displaying the new name in the hide/show button
     when replacing a data group

*** Hephaestus
   - Delay laying out most windows until needed for the first time.
     This speed up startup (~6 1/2 seconds before, now just under 3
     second) at the cost of a bit more time later on.
   - Fixed a bug in furmulas tool where missing density caused a
     divide by zero crash

