Changes.html

<div id="outline-container-orgheadline93" class="outline-4">
<h4 id="orgheadline93"><span class="section-number-4">1.18.3</span> Demeter</h4>
<div class="outline-text-4" id="text-1-18-3">
<ul class="org-ul">
<li>dispense method at a wrapper around dispose and template</li>
<li>chart method at a wrapper around dispose and template for plotting</li>
<li>several new templates to abstract out direct calls to Ifeffit in
preparation for Larch integration</li>
<li>fixed bugs in how rebinning parameters were determined and used</li>
<li>extensive preparation for Larch</li>
<li>added a test for clear<sub>ifeffit</sub><sub>methods</sub> in 004<sub>data.t</sub></li>
<li>fixed several bugs in difference spectrum calculation</li>
<li>fixed various problems involving the use of rebin parameters</li>
<li>framework for path ranking</li>
<li>Better values of Type attribute for FPath and FSPath</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline94" class="outline-4">
<h4 id="orgheadline94"><span class="section-number-4">1.18.4</span> Windows</h4>
<div class="outline-text-4" id="text-1-18-4">
<ul class="org-ul">
<li>updated to most recent Ifeffit from github + patched Feff6L to
allow Am and Cm as absorbers</li>
<li>fixed a problem following shortcuts into folders in certain
situations</li>
<li>explicitly call demeter's version of perl from BAT files, this
invloved a post-installation script run by Inno</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline95" class="outline-4">
<h4 id="orgheadline95"><span class="section-number-4">1.18.5</span> Acknowledgements for this release</h4>
<div class="outline-text-4" id="text-1-18-5">
<ul class="org-ul">
<li>Eric Breynaert</li>
<li>Shelly Kelly</li>
<li>Karine Provost</li>
<li>Andreas Voegelin</li>
<li>Amy Gandy</li>
<li>Bradley Miller</li>
<li>Jason Gaudet</li>
<li>Alfred Hummer</li>
<li>Daniel Whittaker</li>
<li>Matt Frith</li>
<li>The participants of the 2012 ASEAN Workshop on XAS</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline102" class="outline-3">
<h3 id="orgheadline102"><span class="section-number-3">1.19</span> 0.9.10   17 July      2012</h3>
<div class="outline-text-3" id="text-1-19">
</div><div id="outline-container-orgheadline97" class="outline-4">
<h4 id="orgheadline97"><span class="section-number-4">1.19.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-19-1">
<ul class="org-ul">
<li>Improved X23A2 and HXMA plugins</li>
<li>Add a select range button to column selection dialog to help
process data with a large number of columns (e.g. NSLS X3b)</li>
<li>Fixed a bug involving the import plot for the first item in a prj
file when that group uses a background removal standard</li>
<li>File selection dialog presents plotting options based on the
datatype of the selection, also chooses sensible fallback
plotting selection</li>
<li>Generic utility for presenting a table of a single parameter
value.  Context menu entries for this under energy shift and edge
step labels.</li>
<li>Recognize if data sets included in a merge are substantially
shorter than the first set in the group.  If so, exclude them
from the merge.  Made configuration parameters for defining how
much shorter and whether to exclude.</li>
<li>Fixed behavior of up arrow for Athena's string entry dialogs that
have buffers.  The first time pressing up arrow went to an
unpredictable part of the buffer.  It now will go to the most
recent entry.</li>
<li>Force dk and dr to 0 when making empirical standards.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline98" class="outline-4">
<h4 id="orgheadline98"><span class="section-number-4">1.19.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-19-2">
<ul class="org-ul">
<li>Display a useful error message when the phase.bin file is not
computed correctly.  Also clear and do not display intrp tab.</li>
<li>Take care to update paths in Artemis before beginning fit so that
everything (i.e. FPaths) passes sanity checks</li>
<li>Sentinals now work correctly in Artemis for all histogram
functions so that useful updates get written to Data frame
statusbar</li>
<li>Fixed several display issues</li>
<li>Correctly add a new row when using the restraint builder</li>
<li>Save initial guesses of GDS parameters to a project and restore
them</li>
<li>Fit description updated (crudely) when data are replaced</li>
<li>Fixed a bug when discarding a Feff calculation before any paths
have been assigned to a data set</li>
<li>Fixed (I think) a crashy bug when removing GDS parameters</li>
<li>Fixed a bug involving the import of data from a prj file when
that group uses a background removal standard</li>
<li>Ignore data from an Athena project file that cannot be displayed
as chi(k), e.g. XANES data.</li>
<li>Correctly initialize row on GDS page whenever a new parameter is
created</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline99" class="outline-4">
<h4 id="orgheadline99"><span class="section-number-4">1.19.3</span> Atoms</h4>
<div class="outline-text-4" id="text-1-19-3">
<ul class="org-ul">
<li>Disable path DnD for stand-alone Atoms</li>
<li>Added a right click action to the paths list to display details
of scattering geometry</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline100" class="outline-4">
<h4 id="orgheadline100"><span class="section-number-4">1.19.4</span> Hephaestus</h4>
<div class="outline-text-4" id="text-1-19-4">
<ul class="org-ul">
<li>Prevent notebook from capturing carriage return on Windows</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline101" class="outline-4">
<h4 id="orgheadline101"><span class="section-number-4">1.19.5</span> Demeter</h4>
<div class="outline-text-4" id="text-1-19-5">
<ul class="org-ul">
<li>Convert histogram calculations to use PDL &#x2013; much faster!
(backends: LAMMPS, )</li>
<li>Fixed a bug building the ifeffit wrapper</li>
<li>Improved installation.pod</li>
<li>Changed default gnuplot color #4 to yellow4 (#808000)</li>
<li>Added window functions to Rk plot</li>
<li>Made ed plot</li>
<li>Begin Artemis Users' Guide</li>
<li>Prefer the Co K edge to the Re L3 edge when finding the edge (is
that the right choice?)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline108" class="outline-3">
<h3 id="orgheadline108"><span class="section-number-3">1.20</span> 0.9.9    20 April     2012</h3>
<div class="outline-text-3" id="text-1-20">
</div><div id="outline-container-orgheadline103" class="outline-4">
<h4 id="orgheadline103"><span class="section-number-4">1.20.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-20-1">
<ul class="org-ul">
<li>Delay laying out most windows until needed for the first time.
This speed up startup at the cost of a bit more time later on.
Start-up went from about 6 1/2 sec to under 4 seconds on my work
computer</li>
<li>Mostly functional file watcher + added functionality to IO methods</li>
<li>Importance was not being imported from a project file</li>
<li>Made the importance control normal width</li>
<li>Added athena-&gt;interactive<sub>fixstep</sub> configuration parameter for
disabling the interaction between pre-edge, normalization, and
edge step controls and the fixstep button.</li>
<li>when importing a sequence of files and one cannot be imported
(e.g. aborted scan) offer to continue or quit importing sequence</li>
<li>XDI as a known file extension when importing data</li>
<li>Importance and plot<sub>multiplier</sub> functionality for bent Laue data
from 10ID</li>
<li>Return to main button was being displayed incorrectly</li>
<li>Found a normalization bug in Ifeffit, norm<sub>order</sub> not respected in
call to spline().  Submitted patch to Matt.</li>
<li>Smooth works in Calibrate tool</li>
<li>Visual feedback when element &lt; 5 or E0 &lt; 150</li>
<li>Implemented a spin button for incrementing/deincrementing Rbkg</li>
<li>Attempt to recognize data with a zero value in the denominator</li>
<li>Implemented frozen groups + Freeze menu + Athena-&gt;frozen config
parameter for color of frozen group display + button</li>
<li>Display of peak fitting page is functuional (but not quite right)
even on Windows.</li>
<li>Fixed a column selection bug involving the "import each channel"
button</li>
<li>Edge step was not reliably updated after a new plot</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline104" class="outline-4">
<h4 id="orgheadline104"><span class="section-number-4">1.20.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-20-2">
<ul class="org-ul">
<li>Fixed (mostly) a bug laying out Atoms/Feff notebook tabs when
importing a project file.</li>
<li>Fixed a sanity check that got incorrectly triggered when
replacing data with the same data (for example, after going back
to Athena to adjust E0)</li>
<li>Fixed a problem displaying the new name in the hide/show button
when replacing a data group</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline105" class="outline-4">
<h4 id="orgheadline105"><span class="section-number-4">1.20.3</span> Hephaestus</h4>
<div class="outline-text-4" id="text-1-20-3">
<ul class="org-ul">
<li>Delay laying out most windows until needed for the first time.
This speed up startup (~6 1/2 seconds before, now just under 3
second) at the cost of a bit more time later on.</li>
<li>Fixed a bug in furmulas tool where missing density caused a
divide by zero crash</li>
</ul>
</div>
</div>
