Changes.org
*** Atoms stand-alone
   - Used delayed layout and careful loading of Demeter modules to
     reduce start-up from over 5 sec to under 3 seconds.
   - Fixed a bug reading a CIF file that does not properly identify
     the material.  This resulted in the record selection dialog being
     posted without any content -- not so helpful.

*** Demeter
   - Begin using Perl::Version to manage version numbering of files
     and brought every file up to 0.9.9
   - Replaced Readonly with Const::Fast.  See [[http://neilb.org/reviews/constants.html]]
   - Abstracted many common constants to Demeter::Constants
   - Replaced Config::IniFiles with Config::INI for a small
     performance improvement
   - Made Demeter::IniReader, a subclass of Config::INI
   - Fully deprecate use of MooseX::AttributeHelpers and remove it as
     a dependency
   - Make File::Monitor::Lite a recommended module (for data watcher)
   - More care and more options for loading "pragmata" for improved
     startup times
   - Take better care when processing Data not to do normalization and
     spline more often than is necessary
   - Take care not to "use Demeter" unless absolutely necessary
     throughout code base
   - Deal with Unity's use of a global menu
   - Many improvements to histogram subsystem
   - Added a Build directive for forcing update to ifeffit wrapper
   - Cut >20 seconds off the running of the test suite by correctly
     using import "pragmata"
   - Implemented frozen groups as an attribute trait which silently
     disables setting an attribute -- see MooseX::Quenchable.
     Implementing it this deeply in the underlying object obviates the
     issue of disabling Athena's various "action at a distance"
     features, e.g. constaining parameters.
   - Fixed a bug whereby a group with datatype of xanes did not have
     its normalized derivative and second derivative spectra
     calculated.

** 0.9.8    30 January   2012
*** Athena
   - Only set project name if the project name is unset and an entire
     project file is imported
   - In LCF, make the maximum number of groups to use for
     combinatorial fitting practically unlimited
   - In combinatorial fits, sort everything according to position in
     group list
   - Fixed a potantial bug determining units in the CSD when selecting
     chi(k) as the data type

*** Artemis
   - Can now export a particular fit from the history to an fpj file
   - Fixed a bug repopulating the recent files menu
   - Fixed a bug in which the <data>.fit file was deleted as a project
     was imported.  This was the main reason the history plot tool was
     broken.

*** Demeter
   - Add file-chik_out parameter to control how writing a chi(K)
     output file work.  "all" means write a multicolumn file, 0, 1, 2,
     3, or kw mean to write a two-column file using that k-weight
   - Added a tool for efficiently merging a large number of data
     files, see Demeter::Data::BulkMerge
   - Added denergy script

*** Acknowledgements for this release
   - Eric Breynaert
   - Scott Calvin
   - Andreas Voegelin

** 0.9.7    12 January   2012
*** Athena
   - Fixed a problem in the X23A2MED plugin -- it was getting confused
     by an incomplete set of (roi, slow, fast) columns.
   - Fixed a bug resulting in bkg_fixstep sometimes getting unset when
     plotting multiple groups
   - Constraining "Current group" parameters via context menu now
     works correctly.  It had mistakenly changed group attribute, a
     very dangerous thing!
   - Extensive support for current XDI draft
   - In column selection dialog, change reference radio buttons to
     checkbuttons so that either numerator or denominator can be
     unselected.
   - In column selection dialog, unchecking reference ln button
     triggered a crash.
   - Fixed incorrect color sequence for marked group I0 plot.  This
     also made marked group I0 plot crash with >6 marked groups.
   - Post busy cursor when closing a project
   - Reorganized Monitor and debug menus

*** Artemis
   - New icons!
   - Added preview and print buttons to log, history log, history
     report, and journal
   - plot stacking parameters could evaluate to an empty string, so
     explicitly make the 0 in that case
   - can now discard and rename Feff calculations + simple "about
     Feff" dialog
   - fixed a bug causing a segfault when discarding data or feff
   - capture Atoms' statusbar messages in Artemis' status buffer
   - Faster project file import using partial deserialization of each
     item in the fit history.  However, history plot tool is not
     currently working.
   - Reduce R-factor penalty by factor of 10 when fitting in k-space
   - Can now restore a previous fit reliably.

*** Demeter
   - explicitly unset xrange at the start of every gnuplot plot.  this
     should fix any problem where zooming results in a backwards
     x-axis.
   - added clear_ifeffit_titles method to clear out $group_title_NN
     strings when no longer needed, use wrap to make this more efficient
   - bkg_eshift was not applied when saving a group as mu(E) or
     norm(E)
   - serializing Atoms object made safe for GUI display of object
     contents
   - Mechanism for associating metadata with files imported using a
     plugin

*** Acknowledgements for this release
   - Eric Breynaert
   - Scott Calvin
   - Jack Hitch
   - George Sterbinsky
   - Andreas Voegelin

** 0.9.6    12 December  2011
