Changes.html

<div id="outline-container-orgheadline106" class="outline-4">
<h4 id="orgheadline106"><span class="section-number-4">1.20.4</span> Atoms stand-alone</h4>
<div class="outline-text-4" id="text-1-20-4">
<ul class="org-ul">
<li>Used delayed layout and careful loading of Demeter modules to
reduce start-up from over 5 sec to under 3 seconds.</li>
<li>Fixed a bug reading a CIF file that does not properly identify
the material.  This resulted in the record selection dialog being
posted without any content &#x2013; not so helpful.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline107" class="outline-4">
<h4 id="orgheadline107"><span class="section-number-4">1.20.5</span> Demeter</h4>
<div class="outline-text-4" id="text-1-20-5">
<ul class="org-ul">
<li>Begin using Perl::Version to manage version numbering of files
and brought every file up to 0.9.9</li>
<li>Replaced Readonly with Const::Fast.  See <a href="http://neilb.org/reviews/constants.html">http://neilb.org/reviews/constants.html</a></li>
<li>Abstracted many common constants to Demeter::Constants</li>
<li>Replaced Config::IniFiles with Config::INI for a small
performance improvement</li>
<li>Made Demeter::IniReader, a subclass of Config::INI</li>
<li>Fully deprecate use of MooseX::AttributeHelpers and remove it as
a dependency</li>
<li>Make <a href=":Monitor#MissingReference">:Monitor#MissingReference</a> a recommended module (for data watcher)</li>
<li>More care and more options for loading "pragmata" for improved
startup times</li>
<li>Take better care when processing Data not to do normalization and
spline more often than is necessary</li>
<li>Take care not to "use Demeter" unless absolutely necessary
throughout code base</li>
<li>Deal with Unity's use of a global menu</li>
<li>Many improvements to histogram subsystem</li>
<li>Added a Build directive for forcing update to ifeffit wrapper</li>
<li>Cut &gt;20 seconds off the running of the test suite by correctly
using import "pragmata"</li>
<li>Implemented frozen groups as an attribute trait which silently
disables setting an attribute &#x2013; see MooseX::Quenchable.
Implementing it this deeply in the underlying object obviates the
issue of disabling Athena's various "action at a distance"
features, e.g. constaining parameters.</li>
<li>Fixed a bug whereby a group with datatype of xanes did not have
its normalized derivative and second derivative spectra
calculated.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline113" class="outline-3">
<h3 id="orgheadline113"><span class="section-number-3">1.21</span> 0.9.8    30 January   2012</h3>
<div class="outline-text-3" id="text-1-21">
</div><div id="outline-container-orgheadline109" class="outline-4">
<h4 id="orgheadline109"><span class="section-number-4">1.21.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-21-1">
<ul class="org-ul">
<li>Only set project name if the project name is unset and an entire
project file is imported</li>
<li>In LCF, make the maximum number of groups to use for
combinatorial fitting practically unlimited</li>
<li>In combinatorial fits, sort everything according to position in
group list</li>
<li>Fixed a potantial bug determining units in the CSD when selecting
chi(k) as the data type</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline110" class="outline-4">
<h4 id="orgheadline110"><span class="section-number-4">1.21.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-21-2">
<ul class="org-ul">
<li>Can now export a particular fit from the history to an fpj file</li>
<li>Fixed a bug repopulating the recent files menu</li>
<li>Fixed a bug in which the &lt;data&gt;.fit file was deleted as a project
was imported.  This was the main reason the history plot tool was
broken.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline111" class="outline-4">
<h4 id="orgheadline111"><span class="section-number-4">1.21.3</span> Demeter</h4>
<div class="outline-text-4" id="text-1-21-3">
<ul class="org-ul">
<li>Add file-chik<sub>out</sub> parameter to control how writing a chi(K)
output file work.  "all" means write a multicolumn file, 0, 1, 2,
3, or kw mean to write a two-column file using that k-weight</li>
<li>Added a tool for efficiently merging a large number of data
files, see Demeter::Data::BulkMerge</li>
<li>Added denergy script</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline112" class="outline-4">
<h4 id="orgheadline112"><span class="section-number-4">1.21.4</span> Acknowledgements for this release</h4>
<div class="outline-text-4" id="text-1-21-4">
<ul class="org-ul">
<li>Eric Breynaert</li>
<li>Scott Calvin</li>
<li>Andreas Voegelin</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline118" class="outline-3">
<h3 id="orgheadline118"><span class="section-number-3">1.22</span> 0.9.7    12 January   2012</h3>
<div class="outline-text-3" id="text-1-22">
</div><div id="outline-container-orgheadline114" class="outline-4">
<h4 id="orgheadline114"><span class="section-number-4">1.22.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-22-1">
<ul class="org-ul">
<li>Fixed a problem in the X23A2MED plugin &#x2013; it was getting confused
by an incomplete set of (roi, slow, fast) columns.</li>
<li>Fixed a bug resulting in bkg<sub>fixstep</sub> sometimes getting unset when
plotting multiple groups</li>
<li>Constraining "Current group" parameters via context menu now
works correctly.  It had mistakenly changed group attribute, a
very dangerous thing!</li>
<li>Extensive support for current XDI draft</li>
<li>In column selection dialog, change reference radio buttons to
checkbuttons so that either numerator or denominator can be
unselected.</li>
<li>In column selection dialog, unchecking reference ln button
triggered a crash.</li>
<li>Fixed incorrect color sequence for marked group I0 plot.  This
also made marked group I0 plot crash with &gt;6 marked groups.</li>
<li>Post busy cursor when closing a project</li>
<li>Reorganized Monitor and debug menus</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline115" class="outline-4">
<h4 id="orgheadline115"><span class="section-number-4">1.22.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-22-2">
<ul class="org-ul">
<li>New icons!</li>
<li>Added preview and print buttons to log, history log, history
report, and journal</li>
<li>plot stacking parameters could evaluate to an empty string, so
explicitly make the 0 in that case</li>
<li>can now discard and rename Feff calculations + simple "about
Feff" dialog</li>
<li>fixed a bug causing a segfault when discarding data or feff</li>
<li>capture Atoms' statusbar messages in Artemis' status buffer</li>
<li>Faster project file import using partial deserialization of each
item in the fit history.  However, history plot tool is not
currently working.</li>
<li>Reduce R-factor penalty by factor of 10 when fitting in k-space</li>
<li>Can now restore a previous fit reliably.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline116" class="outline-4">
<h4 id="orgheadline116"><span class="section-number-4">1.22.3</span> Demeter</h4>
<div class="outline-text-4" id="text-1-22-3">
<ul class="org-ul">
<li>explicitly unset xrange at the start of every gnuplot plot.  this
should fix any problem where zooming results in a backwards
x-axis.</li>
<li>added clear<sub>ifeffit</sub><sub>titles</sub> method to clear out $group<sub>title</sub><sub>NN</sub>
     strings when no longer needed, use wrap to make this more efficient</li>
<li>bkg<sub>eshift</sub> was not applied when saving a group as mu(E) or
norm(E)</li>
<li>serializing Atoms object made safe for GUI display of object
contents</li>
<li>Mechanism for associating metadata with files imported using a
plugin</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline117" class="outline-4">
<h4 id="orgheadline117"><span class="section-number-4">1.22.4</span> Acknowledgements for this release</h4>
<div class="outline-text-4" id="text-1-22-4">
<ul class="org-ul">
<li>Eric Breynaert</li>
<li>Scott Calvin</li>
<li>Jack Hitch</li>
<li>George Sterbinsky</li>
<li>Andreas Voegelin</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline124" class="outline-3">
<h3 id="orgheadline124"><span class="section-number-3">1.23</span> 0.9.6    12 December  2011</h3>
