Changes.org
*** Athena
   - Fixed bug preventing import of multiple files with each channel
     as a separate group
   - Fixed a bug in which importing MED data as separate groups failed
     to initialize data processing parameters
   - Update column selection dialog when switching from eV to keV
     units
   - Handle keV units correctly for data and reference
   - Handle very noisy reference data by setting the default E0 to the
     tabulated value if the ifeffit-found value is far from the e0 of
     the associated data.  This is essential for data that needs
     rebinning.
   - Correctly handle the situation where a column data file has a
     column named "xmu".  Previously, that situation could lead to
     data being corrupted in an unrecoverable manner as the column
     selection dialog uses that same suffix to hold the mu(E) data.
     This is done by constantly rereading the data file -- something
     that will not happen (happily, since doing so is slow) for any
     file without that column label.
   - Added functionality to column selection dialog for bulk
     (de)selection of numerator checkboxes and for pausing the replot
     of the data while selecting columns (all of which may be useful
     for an MED file)
   - Do some sanity checking on Rebin values in column selection
     dialog before actually rebinning
   - Fixed a bug in both Plot->marked groups menu options

*** Artemis
   - Trim leading and trailing spaces from gds names.
   - Write parameter history reports correctly.
   - Improved window management.  Showing and hiding windows now works
     correctly in conjunction with the window manager's minimize
     (iconize) function.
   - When right clicking on a word in a path parameter math expression
     to define a parameter, the value is now sensitive to which path
     parameter the work comes from (s02 -> 1, sigma2 -> 0.003, else 0)
   - Fixed a windows only bug -- when a feff.inp file is imported, the
     Atoms tab is supposed to be disabled, but the mechanism I used to
     disable selection of that tab was guaranteed to fail on Windows
     (see [[http://docs.wxwidgets.org/2.8.4/wx_wxnotebookevent.html#wxnotebookeventgetselection]])

*** Hephaestus
   - Allow floats as values in the ion chamber tool

*** Demeter
   - Check that user value, then default value of executable
     path (i.e. gnuplot and feff) actually exists before attempting to run
     them.  Also properly quote executable name in system call or pipe so
     that things like spaces and parens are interpeted correctly.
     This guards against a number of issues.  If Demeter is installed on
     Windows in one location, then unistalled and reinstalled elsewhere,
     the ini file will retain the incorrect value.  This also guards
     against having an executable in a place with somethinng like 
     "system (x86)" or a unicode character in the path.
   - Begin playing around with using Demeter::Return as a function's
     return value (see rebin_is_sensible in Demeter::Data::Process
   - Explicitly reset xtics when starting a new plot with gnuplot.
     This is necessary because the components plot afetr a fit
     sequence specifies an array of xtic labels.
   - Prefer the Pd K edge to the Bk L2 edge when finding the edge
   - Set bkg_pre2 to a value which is sensitive to the edge energy.
     For higher energies (i.e. broader edges) move bkg_pre2 to a lower
     energy to improve the default pre-edge line
   - Do a better job of recognizing as data are imported whether an
     energy array is in keV units
   - Filetype plugin written for ESRF BM23, which uses a single scan
     SPEC file.
   - Added ~rebin->use_atomic~ configuration parameter
   - Added a filetype plugin for data from the old SRS.  This is
     intended to cover data from DUBBLE as well (thus deprecating the
     DUBBLE plugin).
   - Test to see whether local time can be used in Demeter's ~now~
     method.  Using local time will make a program die if the
     computer's time zone is not set.  The fallback is to use
     DateTime's floating time zone.
   - Fixed 2 tests in the test suite to respond to recent changes to
     the alignment algorithm and the Fit object's fetch_gds method
   - Correctly identify files as being not data in the case where it
     nominally looks like data (i.e. it has a header and column labels
     as Ifeffit expects), but which has 0, 1, or too few lines of data
   - Made file->minlength configuration parameter to define "too few"
     points in a data file.

*** Acknowledgements for this release
   - The participants of the Diamond 2011 XAFS course who unwittingly
     became beta testers for this software
   - Eric Breynaert
   - George Sterbinsky
   - Brian Mattern

** 0.9.5    11 November  2011
*** Athena
   - Fixed a crash caused by constraining all parameters

** 0.9.4    10 November  2011
*** Athena
   - Fixed a problem accessing the column selection persitance file
     for the first time
   - Fixed a possible crash when importing a damaged project file

*** Artemis
   - Don't list excluded paths in the log file

** 0.9.3     8 November  2011
*** Athena
   - Progress messages when autoaligning marked groups (also truncating)
   - Better first guess for autoalignment ($DS->bkg_e0 - $D->bkg_e0)

*** Artemis
   - Fix a problem importing a project file into which data and Feff
     have been imported, but no paths have yet been assigned to any
     data
   - Check parameter types when importing GDS parameters from a text file

*** Demeter
   - Added ~current~ attribute to Mode as a way of identifying data
     groups in asequence when making progress messages in a GUI

** 0.9.2     7 November  2011
*** Athena
   - Preserve source attribute when reading a project, display it as a
     mouseover for file TextCtrl
   - Plot after pluck
   - Bigger Rbkg control
   - Added some Athena config parameters
   - Fixed a problem with DUBBLE plugin

