Changes.html
<div class="outline-text-3" id="text-1-23">
</div><div id="outline-container-orgheadline119" class="outline-4">
<h4 id="orgheadline119"><span class="section-number-4">1.23.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-23-1">
<ul class="org-ul">
<li>Fixed bug preventing import of multiple files with each channel
as a separate group</li>
<li>Fixed a bug in which importing MED data as separate groups failed
to initialize data processing parameters</li>
<li>Update column selection dialog when switching from eV to keV
units</li>
<li>Handle keV units correctly for data and reference</li>
<li>Handle very noisy reference data by setting the default E0 to the
tabulated value if the ifeffit-found value is far from the e0 of
the associated data.  This is essential for data that needs
rebinning.</li>
<li>Correctly handle the situation where a column data file has a
column named "xmu".  Previously, that situation could lead to
data being corrupted in an unrecoverable manner as the column
selection dialog uses that same suffix to hold the mu(E) data.
This is done by constantly rereading the data file &#x2013; something
that will not happen (happily, since doing so is slow) for any
file without that column label.</li>
<li>Added functionality to column selection dialog for bulk
(de)selection of numerator checkboxes and for pausing the replot
of the data while selecting columns (all of which may be useful
for an MED file)</li>
<li>Do some sanity checking on Rebin values in column selection
dialog before actually rebinning</li>
<li>Fixed a bug in both Plot-&gt;marked groups menu options</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline120" class="outline-4">
<h4 id="orgheadline120"><span class="section-number-4">1.23.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-23-2">
<ul class="org-ul">
<li>Trim leading and trailing spaces from gds names.</li>
<li>Write parameter history reports correctly.</li>
<li>Improved window management.  Showing and hiding windows now works
correctly in conjunction with the window manager's minimize
(iconize) function.</li>
<li>When right clicking on a word in a path parameter math expression
to define a parameter, the value is now sensitive to which path
parameter the work comes from (s02 -&gt; 1, sigma2 -&gt; 0.003, else 0)</li>
<li>Fixed a windows only bug &#x2013; when a feff.inp file is imported, the
Atoms tab is supposed to be disabled, but the mechanism I used to
disable selection of that tab was guaranteed to fail on Windows
(see <a href="http://docs.wxwidgets.org/2.8.4/wx_wxnotebookevent.html#wxnotebookeventgetselection">http://docs.wxwidgets.org/2.8.4/wx_wxnotebookevent.html#wxnotebookeventgetselection</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline121" class="outline-4">
<h4 id="orgheadline121"><span class="section-number-4">1.23.3</span> Hephaestus</h4>
<div class="outline-text-4" id="text-1-23-3">
<ul class="org-ul">
<li>Allow floats as values in the ion chamber tool</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline122" class="outline-4">
<h4 id="orgheadline122"><span class="section-number-4">1.23.4</span> Demeter</h4>
<div class="outline-text-4" id="text-1-23-4">
<ul class="org-ul">
<li>Check that user value, then default value of executable
path (i.e. gnuplot and feff) actually exists before attempting to run
them.  Also properly quote executable name in system call or pipe so
that things like spaces and parens are interpeted correctly.
This guards against a number of issues.  If Demeter is installed on
Windows in one location, then unistalled and reinstalled elsewhere,
the ini file will retain the incorrect value.  This also guards
against having an executable in a place with somethinng like 
"system (x86)" or a unicode character in the path.</li>
<li>Begin playing around with using Demeter::Return as a function's
return value (see rebin<sub>is</sub><sub>sensible</sub> in Demeter::Data::Process</li>
<li>Explicitly reset xtics when starting a new plot with gnuplot.
This is necessary because the components plot afetr a fit
sequence specifies an array of xtic labels.</li>
<li>Prefer the Pd K edge to the Bk L2 edge when finding the edge</li>
<li>Set bkg<sub>pre2</sub> to a value which is sensitive to the edge energy.
For higher energies (i.e. broader edges) move bkg<sub>pre2</sub> to a lower
energy to improve the default pre-edge line</li>
<li>Do a better job of recognizing as data are imported whether an
energy array is in keV units</li>
<li>Filetype plugin written for ESRF BM23, which uses a single scan
SPEC file.</li>
<li>Added <code>rebin-&gt;use_atomic</code> configuration parameter</li>
<li>Added a filetype plugin for data from the old SRS.  This is
intended to cover data from DUBBLE as well (thus deprecating the
DUBBLE plugin).</li>
<li>Test to see whether local time can be used in Demeter's <code>now</code>
method.  Using local time will make a program die if the
computer's time zone is not set.  The fallback is to use
DateTime's floating time zone.</li>
<li>Fixed 2 tests in the test suite to respond to recent changes to
the alignment algorithm and the Fit object's fetch<sub>gds</sub> method</li>
<li>Correctly identify files as being not data in the case where it
nominally looks like data (i.e. it has a header and column labels
as Ifeffit expects), but which has 0, 1, or too few lines of data</li>
<li>Made file-&gt;minlength configuration parameter to define "too few"
points in a data file.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline123" class="outline-4">
<h4 id="orgheadline123"><span class="section-number-4">1.23.5</span> Acknowledgements for this release</h4>
<div class="outline-text-4" id="text-1-23-5">
<ul class="org-ul">
<li>The participants of the Diamond 2011 XAFS course who unwittingly
became beta testers for this software</li>
<li>Eric Breynaert</li>
<li>George Sterbinsky</li>
<li>Brian Mattern</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline126" class="outline-3">
<h3 id="orgheadline126"><span class="section-number-3">1.24</span> 0.9.5    11 November  2011</h3>
<div class="outline-text-3" id="text-1-24">
</div><div id="outline-container-orgheadline125" class="outline-4">
<h4 id="orgheadline125"><span class="section-number-4">1.24.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-24-1">
<ul class="org-ul">
<li>Fixed a crash caused by constraining all parameters</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline129" class="outline-3">
<h3 id="orgheadline129"><span class="section-number-3">1.25</span> 0.9.4    10 November  2011</h3>
<div class="outline-text-3" id="text-1-25">
</div><div id="outline-container-orgheadline127" class="outline-4">
<h4 id="orgheadline127"><span class="section-number-4">1.25.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-25-1">
<ul class="org-ul">
<li>Fixed a problem accessing the column selection persitance file
for the first time</li>
<li>Fixed a possible crash when importing a damaged project file</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline128" class="outline-4">
<h4 id="orgheadline128"><span class="section-number-4">1.25.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-25-2">
<ul class="org-ul">
<li>Don't list excluded paths in the log file</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline133" class="outline-3">
<h3 id="orgheadline133"><span class="section-number-3">1.26</span> 0.9.3     8 November  2011</h3>
<div class="outline-text-3" id="text-1-26">
</div><div id="outline-container-orgheadline130" class="outline-4">
<h4 id="orgheadline130"><span class="section-number-4">1.26.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-26-1">
<ul class="org-ul">
<li>Progress messages when autoaligning marked groups (also truncating)</li>
<li>Better first guess for autoalignment ($DS-&gt;bkg<sub>e0</sub> - $D-&gt;bkg<sub>e0</sub>)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline131" class="outline-4">
<h4 id="orgheadline131"><span class="section-number-4">1.26.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-26-2">
<ul class="org-ul">
<li>Fix a problem importing a project file into which data and Feff
have been imported, but no paths have yet been assigned to any
data</li>
<li>Check parameter types when importing GDS parameters from a text file</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline132" class="outline-4">
<h4 id="orgheadline132"><span class="section-number-4">1.26.3</span> Demeter</h4>
<div class="outline-text-4" id="text-1-26-3">
<ul class="org-ul">
<li>Added <code>current</code> attribute to Mode as a way of identifying data
groups in asequence when making progress messages in a GUI</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline137" class="outline-3">
<h3 id="orgheadline137"><span class="section-number-3">1.27</span> 0.9.2     7 November  2011</h3>
<div class="outline-text-3" id="text-1-27">
</div><div id="outline-container-orgheadline134" class="outline-4">
<h4 id="orgheadline134"><span class="section-number-4">1.27.1</span> Athena</h4>
<div class="outline-text-4" id="text-1-27-1">
<ul class="org-ul">
<li>Preserve source attribute when reading a project, display it as a
mouseover for file TextCtrl</li>
<li>Plot after pluck</li>
<li>Bigger Rbkg control</li>
<li>Added some Athena config parameters</li>
<li>Fixed a problem with DUBBLE plugin</li>
</ul>
</div>
</div>
