Changes.org
*** Artemis
   - Fixed spurious creation of feff workspaces when importoing
     FSPaths from a project
   - Begin work on making Artemis/Atoms fail gracefully with CIF file
     that trigger problems.  Here, it fails gracefully for CIF files
     with partial occupancy.
   - Store parameter and path evaluations in the Fit YAML so that fit
     history can be correctly reconstructed.  This has the drawback of
     breaking old fpj files, in that they will no longer display
     correctly in the history.  Oh well....

*** Thanks to
   - Jason Gaudet
   - Eric Breynaert

** 0.9.1     2 November  2011

*** Artemis
   - Take care with fit_include attribute of the Data in a Fit.  Need
     to set data_total correctly in Ifeffit
   - Fix lots of issues with importing FSPaths from a project file
   - Take care with path seperators when moving aproject between
     windows and unix
   - Take care to populate plot list only with data that was included
     in the fit
   - Added a Fit sanity check to see that each data set has at least
     one path associated with it

*** Thanks to
   - Jason Gaudet

** 0.9.0    31 October   2011

This is substantively identical to beta release 9.  This initial
release will be announced broadly on the mailing list and will be used
at the XAS course at Diamond, Nov. 14-16 2011.

Path to 1.0:
  1. A few successful months of use
  2. PCA, peak fitting, LCF fully implemented in Athena
  3. Histogram fully implemented in Artemis

*** Artemis
   - Verify that fit folder exists before trying to deserialize it
     
     
* Beta testing releases:
  
** Release 9: 30 October   2011

*** Athena
   - Display YAMLs for PCA and PeakFit objects
   - Fixed a bug using one of the self-absorption algorithms
   - YAML displays in Athena for PCA and PeakFit objects
   - changing edge or element now triggers modified indicator
   - rebinning parameters in column selection dialog were not being
     used properly, nor restored for the next data set
   - correctly tie reference channels from project files generated by
     old Athena
   - after a merge group list selection and marking of merged group
     now done correctly
   - Athena project file now records and recovers marked state
   - Record imported and exported athena project files for use in
     "recently used" menus in such a way that they show up in
     Artemis's MRU menu as well.
   - Refuse to plot xanes or chi data as a quadplot.
   - Added a user-specified pause between traces in a marked group
     plot -- this slows down the display of a sequence of traces

*** Artemis
   - Fixed a bug deleting items from plotting list
   - Fixed a bug computing happiness, excluded paths should not be
     evaluated for the pathparam penalty
   - commented out tic mark munging for history reports
   - suppress an extraneous warning box when a fit fails its sanity
     checks
   - Several improvements to behavior of GDS grid
   - Facelift on Atoms page
   - Check to see if temp and theta already exist as parameters when
     using Debye or Eins model from context menu
   - better display of numbers/mathexps in GDS grid with configurable
     precision
   - Atoms was setting angles incorrectly formonoclinic groups at the
     step of verifying angle values against space group and setting
   - it was possible to drag and drop non-numeric text onto the N
     TextCtrl
   - Prompted to save current project if importing a project while
     there appears to be a project started in Artemis.  The current is
     saved or not, then Artemis is cleared, then the new project is
     imported.

*** Demeter
   - Atoms cluster list now tags atoms by shell
   - Forcing display of debug menus in A&A until they become more
     stable
   - Added a recipe for using Empirical standards
   - override ~all~ method in Demeter::PeakFit
   - standards from column files did not have datatype attribute set
     correctly, so standards part of Hephaestus was broken
   - don't run find_edge method on data if the element is already set
     to something other than H
   - Made a ~marked~ attribute of Demeter::Data object for use with
     Athena
   - Corrected an error is sorting the display of the MRU files
   - added plot_pause attribute to the Plot object

*** Windows installer
   - have inno make an Atoms desktop icon

*** Acknowledgements for this release
   - Emmanuel Doelsch
   - Jason Gaudet
   - Shelly Kelly

** Release 8: 11 October   2011

*** Athena
   - use Demeter::FPath so that empirical standard can be written
   - fixstep button was being erroneously ticked due to a bug in
     pre/norm/step interaction
   - ignore project file records that are malformed due to missing
     data arrays
   - resort data if energy column other than 1 is selected in any way
     when using the column selection dialog
   - Now correctly importing MED columns as separate channels

*** Artemis
   - fixed a bug importing chi(k) column data file

*** Demeter
   - Datatype was not set correctly in Data::MultiChannel object

*** Acknowledgements for this release
   - Fred Mosslemans
   - George Sterbinsky

** Release 7: 10 October   2011

*** Athena
   - Handle changes to rmax_out correctly
   - Handle the absence of PDL more gracefully
   - Implemented peak fitting tool
   - Fixed a bug that was slowing down the response of the column
     selection dialog
   - Fixed a bug causing a crash when importing keV data
   - Fixed display of ISO-8859 encoded data files in the column
     selection dialog.
   - Attempt to deal more gracefully with unreadable files

