Changes.html

<div id="outline-container-orgheadline135" class="outline-4">
<h4 id="orgheadline135"><span class="section-number-4">1.27.2</span> Artemis</h4>
<div class="outline-text-4" id="text-1-27-2">
<ul class="org-ul">
<li>Fixed spurious creation of feff workspaces when importoing
FSPaths from a project</li>
<li>Begin work on making Artemis/Atoms fail gracefully with CIF file
that trigger problems.  Here, it fails gracefully for CIF files
with partial occupancy.</li>
<li>Store parameter and path evaluations in the Fit YAML so that fit
history can be correctly reconstructed.  This has the drawback of
breaking old fpj files, in that they will no longer display
correctly in the history.  Oh well&#x2026;.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline136" class="outline-4">
<h4 id="orgheadline136"><span class="section-number-4">1.27.3</span> Thanks to</h4>
<div class="outline-text-4" id="text-1-27-3">
<ul class="org-ul">
<li>Jason Gaudet</li>
<li>Eric Breynaert</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline140" class="outline-3">
<h3 id="orgheadline140"><span class="section-number-3">1.28</span> 0.9.1     2 November  2011</h3>
<div class="outline-text-3" id="text-1-28">
</div><div id="outline-container-orgheadline138" class="outline-4">
<h4 id="orgheadline138"><span class="section-number-4">1.28.1</span> Artemis</h4>
<div class="outline-text-4" id="text-1-28-1">
<ul class="org-ul">
<li>Take care with fit<sub>include</sub> attribute of the Data in a Fit.  Need
to set data<sub>total</sub> correctly in Ifeffit</li>
<li>Fix lots of issues with importing FSPaths from a project file</li>
<li>Take care with path seperators when moving aproject between
windows and unix</li>
<li>Take care to populate plot list only with data that was included
in the fit</li>
<li>Added a Fit sanity check to see that each data set has at least
one path associated with it</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline139" class="outline-4">
<h4 id="orgheadline139"><span class="section-number-4">1.28.2</span> Thanks to</h4>
<div class="outline-text-4" id="text-1-28-2">
<ul class="org-ul">
<li>Jason Gaudet</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline142" class="outline-3">
<h3 id="orgheadline142"><span class="section-number-3">1.29</span> 0.9.0    31 October   2011</h3>
<div class="outline-text-3" id="text-1-29">
<p>
This is substantively identical to beta release 9.  This initial
release will be announced broadly on the mailing list and will be used
at the XAS course at Diamond, Nov. 14-16 2011.
</p>

<p>
Path to 1.0:
</p>
<ol class="org-ol">
<li>A few successful months of use</li>
<li>PCA, peak fitting, LCF fully implemented in Athena</li>
<li>Histogram fully implemented in Artemis</li>
</ol>
</div>

<div id="outline-container-orgheadline141" class="outline-4">
<h4 id="orgheadline141"><span class="section-number-4">1.29.1</span> Artemis</h4>
<div class="outline-text-4" id="text-1-29-1">
<ul class="org-ul">
<li>Verify that fit folder exists before trying to deserialize it</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline189" class="outline-2">
<h2 id="orgheadline189"><span class="section-number-2">2</span> Beta testing releases:</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline149" class="outline-3">
<h3 id="orgheadline149"><span class="section-number-3">2.1</span> Release 9: 30 October   2011</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-orgheadline144" class="outline-4">
<h4 id="orgheadline144"><span class="section-number-4">2.1.1</span> Athena</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Display YAMLs for PCA and PeakFit objects</li>
<li>Fixed a bug using one of the self-absorption algorithms</li>
<li>YAML displays in Athena for PCA and PeakFit objects</li>
<li>changing edge or element now triggers modified indicator</li>
<li>rebinning parameters in column selection dialog were not being
used properly, nor restored for the next data set</li>
<li>correctly tie reference channels from project files generated by
old Athena</li>
<li>after a merge group list selection and marking of merged group
now done correctly</li>
<li>Athena project file now records and recovers marked state</li>
<li>Record imported and exported athena project files for use in
"recently used" menus in such a way that they show up in
Artemis's MRU menu as well.</li>
<li>Refuse to plot xanes or chi data as a quadplot.</li>
<li>Added a user-specified pause between traces in a marked group
plot &#x2013; this slows down the display of a sequence of traces</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline145" class="outline-4">
<h4 id="orgheadline145"><span class="section-number-4">2.1.2</span> Artemis</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>Fixed a bug deleting items from plotting list</li>
<li>Fixed a bug computing happiness, excluded paths should not be
evaluated for the pathparam penalty</li>
<li>commented out tic mark munging for history reports</li>
<li>suppress an extraneous warning box when a fit fails its sanity
checks</li>
<li>Several improvements to behavior of GDS grid</li>
<li>Facelift on Atoms page</li>
<li>Check to see if temp and theta already exist as parameters when
using Debye or Eins model from context menu</li>
<li>better display of numbers/mathexps in GDS grid with configurable
precision</li>
<li>Atoms was setting angles incorrectly formonoclinic groups at the
step of verifying angle values against space group and setting</li>
<li>it was possible to drag and drop non-numeric text onto the N
TextCtrl</li>
<li>Prompted to save current project if importing a project while
there appears to be a project started in Artemis.  The current is
saved or not, then Artemis is cleared, then the new project is
imported.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline146" class="outline-4">
<h4 id="orgheadline146"><span class="section-number-4">2.1.3</span> Demeter</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>Atoms cluster list now tags atoms by shell</li>
<li>Forcing display of debug menus in A&amp;A until they become more
stable</li>
<li>Added a recipe for using Empirical standards</li>
<li>override <code>all</code> method in Demeter::PeakFit</li>
<li>standards from column files did not have datatype attribute set
correctly, so standards part of Hephaestus was broken</li>
<li>don't run find<sub>edge</sub> method on data if the element is already set
to something other than H</li>
<li>Made a <code>marked</code> attribute of Demeter::Data object for use with
Athena</li>
<li>Corrected an error is sorting the display of the MRU files</li>
<li>added plot<sub>pause</sub> attribute to the Plot object</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline147" class="outline-4">
<h4 id="orgheadline147"><span class="section-number-4">2.1.4</span> Windows installer</h4>
<div class="outline-text-4" id="text-2-1-4">
<ul class="org-ul">
<li>have inno make an Atoms desktop icon</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline148" class="outline-4">
<h4 id="orgheadline148"><span class="section-number-4">2.1.5</span> Acknowledgements for this release</h4>
<div class="outline-text-4" id="text-2-1-5">
<ul class="org-ul">
<li>Emmanuel Doelsch</li>
<li>Jason Gaudet</li>
<li>Shelly Kelly</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline154" class="outline-3">
<h3 id="orgheadline154"><span class="section-number-3">2.2</span> Release 8: 11 October   2011</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-orgheadline150" class="outline-4">
<h4 id="orgheadline150"><span class="section-number-4">2.2.1</span> Athena</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>use Demeter::FPath so that empirical standard can be written</li>
<li>fixstep button was being erroneously ticked due to a bug in
pre/norm/step interaction</li>
<li>ignore project file records that are malformed due to missing
data arrays</li>
<li>resort data if energy column other than 1 is selected in any way
when using the column selection dialog</li>
<li>Now correctly importing MED columns as separate channels</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline151" class="outline-4">
<h4 id="orgheadline151"><span class="section-number-4">2.2.2</span> Artemis</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>fixed a bug importing chi(k) column data file</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline152" class="outline-4">
<h4 id="orgheadline152"><span class="section-number-4">2.2.3</span> Demeter</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>Datatype was not set correctly in Data::MultiChannel object</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline153" class="outline-4">
<h4 id="orgheadline153"><span class="section-number-4">2.2.4</span> Acknowledgements for this release</h4>
<div class="outline-text-4" id="text-2-2-4">
<ul class="org-ul">
<li>Fred Mosslemans</li>
<li>George Sterbinsky</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline159" class="outline-3">
<h3 id="orgheadline159"><span class="section-number-3">2.3</span> Release 7: 10 October   2011</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-orgheadline155" class="outline-4">
<h4 id="orgheadline155"><span class="section-number-4">2.3.1</span> Athena</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>Handle changes to rmax<sub>out</sub> correctly</li>
<li>Handle the absence of PDL more gracefully</li>
<li>Implemented peak fitting tool</li>
<li>Fixed a bug that was slowing down the response of the column
selection dialog</li>
<li>Fixed a bug causing a crash when importing keV data</li>
<li>Fixed display of ISO-8859 encoded data files in the column
selection dialog.</li>
<li>Attempt to deal more gracefully with unreadable files</li>
</ul>
</div>
</div>
