Changes.org
*** Artemis
   - Fixed a formatting error reporting correlations in the log file
   - Changed the logic for how GDS params get updated before a plot
   - Issue Ifeffit's unguess command at the beginning of a fit to make
     sure that discarded or skipped (or def-ed or set) guess
     parameters do not remain as guesses in Ifeffit, which makes it
     impossible to evaluate uncertainties.
   - Fixed a bug in how the pathfinder->label configuration parameter
     was being interpreted.  Also changed the default absorber token
     to @
   - Handle changes to rmax_out correctly
   - Fixed a bug importing projects from earlier versions of Artemis
     (deprecated nindicators attribute of the Plot onject)
   - Quick first shell (FSPath) now properly respects a change in N
   - Fixed a bug wherein Artemis would crash reading a project file
     with a quick first shell (FSPath) object
   - Implemented drag-n-drop for cloning a path and copying a path to
     other data sets
   - Fixed a bug cloning quick first shell (FSPath) objects
   - Artemis now respects choice of fit space.
   - Right click on words in path parameter math expressions to post a
     context menu for creating/modifying GDS parameters
   - Fixed a bug precluding creating an atoms.inp by hand via the GUI

*** Demeter
   - Fixed a problem interpreting rhombohedral space groups in Atoms.
   - Implemented peak fitting using Ifeffit as the backend (other
     option is fityk)
   - Files with very wide column label lines can run into a length
     limit in Ifeffit, specifically in ishtxt iff_show.f.  Since
     Demeter relies on Ifeffit reporting $column_label correctly, this
     lead to truncation of columns available when importing such data.
   - Made the save_many and save("fit",...) methods understand either
     set of strings denoting the part to be saved.  (save_many took
     things like 'chik2' and 'chir_mag', which save("fit",...) took
     things like 'k2' and 'rmag').  Also added a useful error message
     to save_many warning against passing it ScatteringPath objects.
   - Improvements to the Dubble plugin
   - Fit sanity check: notice an obvious case of attempting to use the
     same data set more than once in a multiple data set fit.  This is
     presumed to be a naughty attempt to increase Nidp.
   - Inverted residual function in PCA plots
   - Fixed several bugs importing already-normalized data
   - Added Encoding::FixLatin as a dependence.  There is some chance
     of data corruption using this tool, but since it is only used for
     display of text in a GUI and not for passing data to Ifeffit,
     this is not a very serious problem.
   - Fixed a bug wherein a cloned Data group did not have its
     derivative computed
   - Fixed a bug in aligning data.  Also modified code to perform
     alignment exactly like the old version.  Made "interp" the
     default interpolation function (was qinterp).
   - Found a few places where files or directories were opened and not
     closed 
   - The element symbol type constraint was missing Am through Cf
   - New "trace" method for printing a colorized stack trace from any
     location to stdout
   - Fixed a bug in the automated alignment algorithm (now using
     data's current bkg_eshift as the initial guess)

*** Acknowledgements for this release
   - Eric Breynaert, superstar (literally dozens of bug reports from the last release!)
   - George Sterbinsky
   - Shelly Kelly
   - Erik Farquhar
   - Scott Calvin

** Release 6: 09 September 2011
*** Athena
   - Corrected the behavior of the LCF tool when plotting without
     fitting in several edge cases that involve either a single
     standard or weights set by hand
   - Added a fourth plotting terminal
   - Issue error to statusbar when kmax_suggest is oddly small
   - Implemented Scott's deriv(phase(chi(R))) idea with a
     configuration parameter for turning it on and off
   - Copying a group now copies its marked state
   - Added invert button to column selection dialog
   - Implemented PCA tool
   - Commented out Freeze menu since group freezing is currently
     unimplemented

*** Artemis
   - Added a fourth plotting terminal
   - Make the import file menu entry recognize all plausible file
     types and do the right thing.  This makes the Import submenu
     somewhat redundant.
   - Issue error to statusbar when kmax_suggest is oddly small
   - Add triangular paths to Histogram subsystem

*** Demeter
   - When reading epsilon from Ifeffit, recognize when it finds NaN
     and do something sensible
   - Implemented Scott's deriv(phase(chi(R))) idea in all plotting
     backends and in column output
   - Boolean flag for indicating a single data group fit and setting
     the Data plotkey attribute appropriately in R or q.
   - Fixed a configuration bug wherein the GUIs could clobber one
     another's configuration changes
   - Added inv attribute for negating column selection
   - Implemented PCA using PDL + specialty plots

*** Acknowledgements for this release
   - Fred Mosselmans
   - Scott Calvin
   - Eric Breynaert

** Release 5: 18 August    2011
*** Athena
   - Fixed a display problem in the column selection dialog
   - Fixed several problems with restoring LCF fits after performing a
     combinatorial sequence
   - Allow seeting window function for back transform independently
   - Fix default settings for LCF object in athena's LCF dialog
   - Tie together merge and reference for merge when the reference for
     the merge is also made
   - Added a "change all groups" option to the chnage type dialog
   - Made the LCF layout a bit prettier
   - Do not unlink autosave file at start-up -- it needs to stick
     around in case the problem that lead to the crash happens again
   - Improved behavior for Copy group feature

*** Artemis
   - Allow seeting window function for back transform independently
   - Fixed a bug involving non-zero values of arbitrary k-weighting
     when importing old-style project files

*** Demeter
   - Correctly restore restoring LCF fits after performing a
     combinatorial sequence

*** Acknowledgements for this release
   - Eric Breynaert
   - Emmanuel Doelsch
   - Scott Calvin
   - Van Vu
   - Chris Patridge

** Release 4: 12 August    2011
