Changes.html

<div id="outline-container-orgheadline156" class="outline-4">
<h4 id="orgheadline156"><span class="section-number-4">2.3.2</span> Artemis</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li>Fixed a formatting error reporting correlations in the log file</li>
<li>Changed the logic for how GDS params get updated before a plot</li>
<li>Issue Ifeffit's unguess command at the beginning of a fit to make
sure that discarded or skipped (or def-ed or set) guess
parameters do not remain as guesses in Ifeffit, which makes it
impossible to evaluate uncertainties.</li>
<li>Fixed a bug in how the pathfinder-&gt;label configuration parameter
was being interpreted.  Also changed the default absorber token
to @</li>
<li>Handle changes to rmax<sub>out</sub> correctly</li>
<li>Fixed a bug importing projects from earlier versions of Artemis
(deprecated nindicators attribute of the Plot onject)</li>
<li>Quick first shell (FSPath) now properly respects a change in N</li>
<li>Fixed a bug wherein Artemis would crash reading a project file
with a quick first shell (FSPath) object</li>
<li>Implemented drag-n-drop for cloning a path and copying a path to
other data sets</li>
<li>Fixed a bug cloning quick first shell (FSPath) objects</li>
<li>Artemis now respects choice of fit space.</li>
<li>Right click on words in path parameter math expressions to post a
context menu for creating/modifying GDS parameters</li>
<li>Fixed a bug precluding creating an atoms.inp by hand via the GUI</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline157" class="outline-4">
<h4 id="orgheadline157"><span class="section-number-4">2.3.3</span> Demeter</h4>
<div class="outline-text-4" id="text-2-3-3">
<ul class="org-ul">
<li>Fixed a problem interpreting rhombohedral space groups in Atoms.</li>
<li>Implemented peak fitting using Ifeffit as the backend (other
option is fityk)</li>
<li>Files with very wide column label lines can run into a length
limit in Ifeffit, specifically in ishtxt iff<sub>show.f</sub>.  Since
Demeter relies on Ifeffit reporting $column<sub>label</sub> correctly, this
lead to truncation of columns available when importing such data.</li>
<li>Made the save<sub>many</sub> and save("fit",&#x2026;) methods understand either
set of strings denoting the part to be saved.  (save<sub>many</sub> took
things like 'chik2' and 'chir<sub>mag</sub>', which save("fit",&#x2026;) took
things like 'k2' and 'rmag').  Also added a useful error message
to save<sub>many</sub> warning against passing it ScatteringPath objects.</li>
<li>Improvements to the Dubble plugin</li>
<li>Fit sanity check: notice an obvious case of attempting to use the
same data set more than once in a multiple data set fit.  This is
presumed to be a naughty attempt to increase Nidp.</li>
<li>Inverted residual function in PCA plots</li>
<li>Fixed several bugs importing already-normalized data</li>
<li>Added Encoding::FixLatin as a dependence.  There is some chance
of data corruption using this tool, but since it is only used for
display of text in a GUI and not for passing data to Ifeffit,
this is not a very serious problem.</li>
<li>Fixed a bug wherein a cloned Data group did not have its
derivative computed</li>
<li>Fixed a bug in aligning data.  Also modified code to perform
alignment exactly like the old version.  Made "interp" the
default interpolation function (was qinterp).</li>
<li>Found a few places where files or directories were opened and not
closed</li>
<li>The element symbol type constraint was missing Am through Cf</li>
<li>New "trace" method for printing a colorized stack trace from any
location to stdout</li>
<li>Fixed a bug in the automated alignment algorithm (now using
data's current bkg<sub>eshift</sub> as the initial guess)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline158" class="outline-4">
<h4 id="orgheadline158"><span class="section-number-4">2.3.4</span> Acknowledgements for this release</h4>
<div class="outline-text-4" id="text-2-3-4">
<ul class="org-ul">
<li>Eric Breynaert, superstar (literally dozens of bug reports from the last release!)</li>
<li>George Sterbinsky</li>
<li>Shelly Kelly</li>
<li>Erik Farquhar</li>
<li>Scott Calvin</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline164" class="outline-3">
<h3 id="orgheadline164"><span class="section-number-3">2.4</span> Release 6: 09 September 2011</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-orgheadline160" class="outline-4">
<h4 id="orgheadline160"><span class="section-number-4">2.4.1</span> Athena</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>Corrected the behavior of the LCF tool when plotting without
fitting in several edge cases that involve either a single
standard or weights set by hand</li>
<li>Added a fourth plotting terminal</li>
<li>Issue error to statusbar when kmax<sub>suggest</sub> is oddly small</li>
<li>Implemented Scott's deriv(phase(chi(R))) idea with a
configuration parameter for turning it on and off</li>
<li>Copying a group now copies its marked state</li>
<li>Added invert button to column selection dialog</li>
<li>Implemented PCA tool</li>
<li>Commented out Freeze menu since group freezing is currently
unimplemented</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline161" class="outline-4">
<h4 id="orgheadline161"><span class="section-number-4">2.4.2</span> Artemis</h4>
<div class="outline-text-4" id="text-2-4-2">
<ul class="org-ul">
<li>Added a fourth plotting terminal</li>
<li>Make the import file menu entry recognize all plausible file
types and do the right thing.  This makes the Import submenu
somewhat redundant.</li>
<li>Issue error to statusbar when kmax<sub>suggest</sub> is oddly small</li>
<li>Add triangular paths to Histogram subsystem</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline162" class="outline-4">
<h4 id="orgheadline162"><span class="section-number-4">2.4.3</span> Demeter</h4>
<div class="outline-text-4" id="text-2-4-3">
<ul class="org-ul">
<li>When reading epsilon from Ifeffit, recognize when it finds NaN
and do something sensible</li>
<li>Implemented Scott's deriv(phase(chi(R))) idea in all plotting
backends and in column output</li>
<li>Boolean flag for indicating a single data group fit and setting
the Data plotkey attribute appropriately in R or q.</li>
<li>Fixed a configuration bug wherein the GUIs could clobber one
another's configuration changes</li>
<li>Added inv attribute for negating column selection</li>
<li>Implemented PCA using PDL + specialty plots</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline163" class="outline-4">
<h4 id="orgheadline163"><span class="section-number-4">2.4.4</span> Acknowledgements for this release</h4>
<div class="outline-text-4" id="text-2-4-4">
<ul class="org-ul">
<li>Fred Mosselmans</li>
<li>Scott Calvin</li>
<li>Eric Breynaert</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline169" class="outline-3">
<h3 id="orgheadline169"><span class="section-number-3">2.5</span> Release 5: 18 August    2011</h3>
<div class="outline-text-3" id="text-2-5">
</div><div id="outline-container-orgheadline165" class="outline-4">
<h4 id="orgheadline165"><span class="section-number-4">2.5.1</span> Athena</h4>
<div class="outline-text-4" id="text-2-5-1">
<ul class="org-ul">
<li>Fixed a display problem in the column selection dialog</li>
<li>Fixed several problems with restoring LCF fits after performing a
combinatorial sequence</li>
<li>Allow seeting window function for back transform independently</li>
<li>Fix default settings for LCF object in athena's LCF dialog</li>
<li>Tie together merge and reference for merge when the reference for
the merge is also made</li>
<li>Added a "change all groups" option to the chnage type dialog</li>
<li>Made the LCF layout a bit prettier</li>
<li>Do not unlink autosave file at start-up &#x2013; it needs to stick
around in case the problem that lead to the crash happens again</li>
<li>Improved behavior for Copy group feature</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline166" class="outline-4">
<h4 id="orgheadline166"><span class="section-number-4">2.5.2</span> Artemis</h4>
<div class="outline-text-4" id="text-2-5-2">
<ul class="org-ul">
<li>Allow seeting window function for back transform independently</li>
<li>Fixed a bug involving non-zero values of arbitrary k-weighting
when importing old-style project files</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline167" class="outline-4">
<h4 id="orgheadline167"><span class="section-number-4">2.5.3</span> Demeter</h4>
<div class="outline-text-4" id="text-2-5-3">
<ul class="org-ul">
<li>Correctly restore restoring LCF fits after performing a
combinatorial sequence</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline168" class="outline-4">
<h4 id="orgheadline168"><span class="section-number-4">2.5.4</span> Acknowledgements for this release</h4>
<div class="outline-text-4" id="text-2-5-4">
<ul class="org-ul">
<li>Eric Breynaert</li>
<li>Emmanuel Doelsch</li>
<li>Scott Calvin</li>
<li>Van Vu</li>
<li>Chris Patridge</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline175" class="outline-3">
<h3 id="orgheadline175"><span class="section-number-3">2.6</span> Release 4: 12 August    2011</h3>
