Changes.org
*** Athena
   - Inmplemented an autosave feature + recovery of autosave after a crash
   - Fixed several LCF bugs
   - Use arbitrary k-weights more sensibly
   - Fixed a bug plucking spline range in k
   - Better message in pluck dialog
   - Use demeter's configuration dialog to configure Plugins that have
     configuration parameters (currently, 10BMMultiChannel and X23A2MED)

*** Artemis
   - The path-like tab in the Atoms/Feff frame is now set correctly
     when importing a project file
   - Replacing chi(k) on a Data frame now works correctly
   - More descriptive update messages in statusbar during histogram
     processing
   - Histogram interface is more sensitive to whether time-consuming
     chores need to be redone
   - Grid in GDS frame now recognizes smart keys for changing
     parameter type.  Change all selected params:
       + Alt-g: guess
       + Alt-s: set
       + Alt-d: def
       + Alt-l: lguess
       + Alt-k: skip
       + Alt-a: after
       + Alt-r: restrain
       + Alt-p: penalty
   - New config parameter (artemis->plot_frame_x) for aligning the
     Plot window properly on a multiple monitor setup (something I am
     having trouble figuring out properly)
   - Follow Windows link files for various import types
   - Check file type on import for:
       + fitting projects
       + Athena projects
       + old-style fitting projects
       + demeter serializations
       + chi(k) data (this is imperfect -- mu(E) data, for instance,will pass the test)
   - Use arbitrary k-weights more sensibly
   - Fix a bug creating a blank Atoms frame wherein one could not
     return to the Atoms tab
   - Fixed a bug importing autosave file

*** Demeter
   - Integrate VASP MD output into histogram subsystem
   - Follow Windows link files now done for every object that has a
     file attribute
   - More sensible behavior using arbitrary k-weighting
   - Fixed a bug plotting indicators with phase part of chi(R)

*** Windows installer

*** Acknowledgements for this release
   1. Scott Calvin
   2. Emmanuel Dolsch
   3. Van Vu

** Release 3:  8 July      2011
*** Athena
   - Plugin registry: right click open a menu with for plugin
     documentation (POD converted to text, displayed in a
     Demeter::UI::Artemis::ShowText) and a configuration utility for
     those plugins with an ini file.
   - Fixed several problems with the automation of the column
     selection dialog
   - The X23A2MED plugin now configures itself on the first use and
     responds gracefully to misconfiguration.  It also handles data
     from the 1-element Vortex.
   - Pluck buttons implemented in more places
   - Merging groups with reference channels also merges reference
     channels into a reference group for the merge
   - Tools for monitoring Ifeffit's memory use
   - Modified SSRLA plugin to handle data from the ESRF ROBL beamline.
     ROBL writes some high-ASCII characters in a way that confuses the
     column selection dialog, so theplugin strips them from the file
   - Athena is now capable of following windows shortcut (.lnk) files

*** Artemis
    - Pluck buttons now work on the Data page and on the indicators tab

*** Demeter
   - Changed the default color of indicators to a dark brown, which
     stand out better against a red trace (i.e. line color #2)
   - Mode object now has attributes for keeping track of Ifeffit's
     memory use.  Data and Path _update methods + Fit and LCF fit
     methods update those attributes.

*** Windows installer
   - This time I *really* made it so that all bat file launchers save
     STDOUT and STDERR from the current session to a log file in
     %APPDATA%\demeter\
   - Make %APPDATA%\demeter\ at install time if it does not already
     exist
   - Compile Ifeffit with an 8 Mb heap, more arrays, and more Feff
     paths.

*** Acknowledgements for this release
    Same gang as last time + Stephen Price.

** Release 2: 24 June      2011
*** Athena
   - Fixed some language issues in the Files menu
   - Fixed several bugs surrounding the bkg_fixstep Data attribute and
     made its behavior in relation to editing the normalization,
     pre-edge, and edge step text entry boxes more sensible
   - Added wxTE_PROCESS_ENTER style to all text entry boxes.  This
     allows replotting or other actions (or none at all) upon hitting
     return with focus in a text box.  This is in response to a
     complaint that hitting enter in a text box caused focus to shift
     unexpectedly and to a request for more functionality.
   - Rewrote the quad plot
   - Clarified language used in stack tab of plotting options section
   - Fix a problem doing LCF fits with the final weight being negative
     when weights constrained to be non-negative and to sum to one.
   - Escape underscores in gnuplot plot legend for LCF plots
   - Fixed a bug using a background removal standard
   - Athena now reads chi(k) data files correctly
   - Group list:
       - Control-drag to rearrange groups in group list
       - Ctrl-j/Ctrl-k to change focus up and down in the groups list
       - Alt-j/Alt-k to move groups up and down in the groups list
   - Work around spurious error message when plucking from Gnuplot on
     Windows
   - Multiple plotting terminals with Gnuplot
   - Configure utility for filetype plugins that come with
     configuration files

*** Artemis
   - Completely rewrote mechanism for importing old-style Artemis
     project files, which now works much more reliably.
   - Feff object's rdinp method now recognizes a Feff8 input file.
     This is mostly used by Artemis to refuse to import such a thing as
     Feff8 is not yet supported in Demeter
   - Implemented Rk plot and made a button for it
   - Added wxTE_PROCESS_ENTER style to all one-line text entry boxes.
   - Multiple plotting terminals with Gnuplot

*** Demeter
   - Changes to selection of the plotting backend just prior to R1
     broke most of the tests.  Both the selection mechanism and all the
     tests were fixed.

*** Windows Installer
   - Renamed desktop icons so as to not overwrite Horae's icons
   - All bat file launchers save STDOUT and STDERR from the current
     session to a log file in %APPDATA%\demeter\

