Changes.html
<div class="outline-text-3" id="text-2-6">
</div><div id="outline-container-orgheadline170" class="outline-4">
<h4 id="orgheadline170"><span class="section-number-4">2.6.1</span> Athena</h4>
<div class="outline-text-4" id="text-2-6-1">
<ul class="org-ul">
<li>Inmplemented an autosave feature + recovery of autosave after a crash</li>
<li>Fixed several LCF bugs</li>
<li>Use arbitrary k-weights more sensibly</li>
<li>Fixed a bug plucking spline range in k</li>
<li>Better message in pluck dialog</li>
<li>Use demeter's configuration dialog to configure Plugins that have
configuration parameters (currently, 10BMMultiChannel and X23A2MED)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline171" class="outline-4">
<h4 id="orgheadline171"><span class="section-number-4">2.6.2</span> Artemis</h4>
<div class="outline-text-4" id="text-2-6-2">
<ul class="org-ul">
<li>The path-like tab in the Atoms/Feff frame is now set correctly
when importing a project file</li>
<li>Replacing chi(k) on a Data frame now works correctly</li>
<li>More descriptive update messages in statusbar during histogram
processing</li>
<li>Histogram interface is more sensitive to whether time-consuming
chores need to be redone</li>
<li>Grid in GDS frame now recognizes smart keys for changing
parameter type.  Change all selected params:
<ul class="org-ul">
<li>Alt-g: guess</li>
<li>Alt-s: set</li>
<li>Alt-d: def</li>
<li>Alt-l: lguess</li>
<li>Alt-k: skip</li>
<li>Alt-a: after</li>
<li>Alt-r: restrain</li>
<li>Alt-p: penalty</li>
</ul></li>
<li>New config parameter (artemis-&gt;plot<sub>frame</sub><sub>x</sub>) for aligning the
Plot window properly on a multiple monitor setup (something I am
having trouble figuring out properly)</li>
<li>Follow Windows link files for various import types</li>
<li>Check file type on import for:
<ul class="org-ul">
<li>fitting projects</li>
<li>Athena projects</li>
<li>old-style fitting projects</li>
<li>demeter serializations</li>
<li>chi(k) data (this is imperfect &#x2013; mu(E) data, for instance,will pass the test)</li>
</ul></li>
<li>Use arbitrary k-weights more sensibly</li>
<li>Fix a bug creating a blank Atoms frame wherein one could not
return to the Atoms tab</li>
<li>Fixed a bug importing autosave file</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline172" class="outline-4">
<h4 id="orgheadline172"><span class="section-number-4">2.6.3</span> Demeter</h4>
<div class="outline-text-4" id="text-2-6-3">
<ul class="org-ul">
<li>Integrate VASP MD output into histogram subsystem</li>
<li>Follow Windows link files now done for every object that has a
file attribute</li>
<li>More sensible behavior using arbitrary k-weighting</li>
<li>Fixed a bug plotting indicators with phase part of chi(R)</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline173" class="outline-4">
<h4 id="orgheadline173"><span class="section-number-4">2.6.4</span> Windows installer</h4>
</div>

<div id="outline-container-orgheadline174" class="outline-4">
<h4 id="orgheadline174"><span class="section-number-4">2.6.5</span> Acknowledgements for this release</h4>
<div class="outline-text-4" id="text-2-6-5">
<ol class="org-ol">
<li>Scott Calvin</li>
<li>Emmanuel Dolsch</li>
<li>Van Vu</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline181" class="outline-3">
<h3 id="orgheadline181"><span class="section-number-3">2.7</span> Release 3:  8 July      2011</h3>
<div class="outline-text-3" id="text-2-7">
</div><div id="outline-container-orgheadline176" class="outline-4">
<h4 id="orgheadline176"><span class="section-number-4">2.7.1</span> Athena</h4>
<div class="outline-text-4" id="text-2-7-1">
<ul class="org-ul">
<li>Plugin registry: right click open a menu with for plugin
documentation (POD converted to text, displayed in a
Demeter::UI::Artemis::ShowText) and a configuration utility for
those plugins with an ini file.</li>
<li>Fixed several problems with the automation of the column
selection dialog</li>
<li>The X23A2MED plugin now configures itself on the first use and
responds gracefully to misconfiguration.  It also handles data
from the 1-element Vortex.</li>
<li>Pluck buttons implemented in more places</li>
<li>Merging groups with reference channels also merges reference
channels into a reference group for the merge</li>
<li>Tools for monitoring Ifeffit's memory use</li>
<li>Modified SSRLA plugin to handle data from the ESRF ROBL beamline.
ROBL writes some high-ASCII characters in a way that confuses the
column selection dialog, so theplugin strips them from the file</li>
<li>Athena is now capable of following windows shortcut (.lnk) files</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline177" class="outline-4">
<h4 id="orgheadline177"><span class="section-number-4">2.7.2</span> Artemis</h4>
<div class="outline-text-4" id="text-2-7-2">
<ul class="org-ul">
<li>Pluck buttons now work on the Data page and on the indicators tab</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline178" class="outline-4">
<h4 id="orgheadline178"><span class="section-number-4">2.7.3</span> Demeter</h4>
<div class="outline-text-4" id="text-2-7-3">
<ul class="org-ul">
<li>Changed the default color of indicators to a dark brown, which
stand out better against a red trace (i.e. line color #2)</li>
<li>Mode object now has attributes for keeping track of Ifeffit's
memory use.  Data and Path _update methods + Fit and LCF fit
methods update those attributes.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline179" class="outline-4">
<h4 id="orgheadline179"><span class="section-number-4">2.7.4</span> Windows installer</h4>
<div class="outline-text-4" id="text-2-7-4">
<ul class="org-ul">
<li>This time I <b>really</b> made it so that all bat file launchers save
STDOUT and STDERR from the current session to a log file in
%APPDATA%\demeter\</li>
<li>Make %APPDATA%\demeter\ at install time if it does not already
exist</li>
<li>Compile Ifeffit with an 8 Mb heap, more arrays, and more Feff
paths.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline180" class="outline-4">
<h4 id="orgheadline180"><span class="section-number-4">2.7.5</span> Acknowledgements for this release</h4>
<div class="outline-text-4" id="text-2-7-5">
<p>
Same gang as last time + Stephen Price.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline187" class="outline-3">
<h3 id="orgheadline187"><span class="section-number-3">2.8</span> Release 2: 24 June      2011</h3>
<div class="outline-text-3" id="text-2-8">
</div><div id="outline-container-orgheadline182" class="outline-4">
<h4 id="orgheadline182"><span class="section-number-4">2.8.1</span> Athena</h4>
<div class="outline-text-4" id="text-2-8-1">
<ul class="org-ul">
<li>Fixed some language issues in the Files menu</li>
<li>Fixed several bugs surrounding the bkg<sub>fixstep</sub> Data attribute and
made its behavior in relation to editing the normalization,
pre-edge, and edge step text entry boxes more sensible</li>
<li>Added wxTE<sub>PROCESS</sub><sub>ENTER</sub> style to all text entry boxes.  This
allows replotting or other actions (or none at all) upon hitting
return with focus in a text box.  This is in response to a
complaint that hitting enter in a text box caused focus to shift
unexpectedly and to a request for more functionality.</li>
<li>Rewrote the quad plot</li>
<li>Clarified language used in stack tab of plotting options section</li>
<li>Fix a problem doing LCF fits with the final weight being negative
when weights constrained to be non-negative and to sum to one.</li>
<li>Escape underscores in gnuplot plot legend for LCF plots</li>
<li>Fixed a bug using a background removal standard</li>
<li>Athena now reads chi(k) data files correctly</li>
<li>Group list:
<ul class="org-ul">
<li>Control-drag to rearrange groups in group list</li>
<li>Ctrl-j/Ctrl-k to change focus up and down in the groups list</li>
<li>Alt-j/Alt-k to move groups up and down in the groups list</li>
</ul></li>
<li>Work around spurious error message when plucking from Gnuplot on
Windows</li>
<li>Multiple plotting terminals with Gnuplot</li>
<li>Configure utility for filetype plugins that come with
configuration files</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline183" class="outline-4">
<h4 id="orgheadline183"><span class="section-number-4">2.8.2</span> Artemis</h4>
<div class="outline-text-4" id="text-2-8-2">
<ul class="org-ul">
<li>Completely rewrote mechanism for importing old-style Artemis
project files, which now works much more reliably.</li>
<li>Feff object's rdinp method now recognizes a Feff8 input file.
This is mostly used by Artemis to refuse to import such a thing as
Feff8 is not yet supported in Demeter</li>
<li>Implemented Rk plot and made a button for it</li>
<li>Added wxTE<sub>PROCESS</sub><sub>ENTER</sub> style to all one-line text entry boxes.</li>
<li>Multiple plotting terminals with Gnuplot</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline184" class="outline-4">
<h4 id="orgheadline184"><span class="section-number-4">2.8.3</span> Demeter</h4>
<div class="outline-text-4" id="text-2-8-3">
<ul class="org-ul">
<li>Changes to selection of the plotting backend just prior to R1
broke most of the tests.  Both the selection mechanism and all the
tests were fixed.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline185" class="outline-4">
<h4 id="orgheadline185"><span class="section-number-4">2.8.4</span> Windows Installer</h4>
<div class="outline-text-4" id="text-2-8-4">
<ul class="org-ul">
<li>Renamed desktop icons so as to not overwrite Horae's icons</li>
<li>All bat file launchers save STDOUT and STDERR from the current
session to a log file in %APPDATA%\demeter\</li>
</ul>
</div>
</div>
